[
    [
        "As well, the Eng Neo, Chantek and Anak Bukit Flyovers were structurally expanded.",
        {
            "entities": [
                [
                    34,
                    44,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "A branch line from Hougang to Jalan Kayu was also proposed.",
        {
            "entities": [
                [
                    19,
                    26,
                    "LOC"
                ],
                [
                    30,
                    40,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "A criminal inquiry found the main contractor Nishimatsu Construction Company and joint venture partner firm Lum Chang Construction Company and their officers, as well as key Land Transport Authority officers responsible for the collapse.",
        {
            "entities": [
                [
                    174,
                    198,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "It consists of four housing zones namely Alkaff District, Woodleigh District, Park Edge District, and Bartley Heights District.",
        {
            "entities": [
                [
                    41,
                    56,
                    "LOC"
                ],
                [
                    58,
                    67,
                    "LOC"
                ],
                [
                    102,
                    109,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "OCLC 52771106.External links Media related to Chinatown MRT Station at Wikimedia CommonsOfficial websiteChangi Airport to Chinatown by MRT",
        {
            "entities": [
                [
                    46,
                    67,
                    "LOC"
                ],
                [
                    122,
                    131,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "An additional cruise terminal, the Marina Bay Cruise Centre Singapore, began construction in 2009 and was completed in 2012 in order to accommodate bigger cruise ships that are not able to dock at the Singapore Cruise Centre.",
        {
            "entities": [
                [
                    35,
                    69,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Guoco Midtown and Midtown IIGuoco Midtown, a mixed-use development by GuocoLand is currently under construction.",
        {
            "entities": [
                [
                    0,
                    13,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "This incident resulted in a 2.5-hour service delay between Tanah Merah and Pasir Ris Stations, affecting at least 10,000 commuters.",
        {
            "entities": [
                [
                    59,
                    70,
                    "LOC"
                ],
                [
                    75,
                    84,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Tai Seng Facility Building, connected to and located east of Kim Chuan Depot, is currently used for the Downtown line.",
        {
            "entities": [
                [
                    0,
                    8,
                    "LOC"
                ],
                [
                    61,
                    76,
                    "LOC"
                ],
                [
                    104,
                    112,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Two new stations will be added on the North South line.",
        {
            "entities": [
                [
                    38,
                    49,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The development will be integrated with the adjacent larger Guoco Midtown and bring about greater connectivity in the area.",
        {
            "entities": [
                [
                    60,
                    73,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "A double-volume atrium entryway and outdoor plaza will also be built to welcome visitors arriving from the Bras Basah MRT station.",
        {
            "entities": [
                [
                    107,
                    117,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Key developments in the city core include Shenton Way (Singapore's Wall Street) and Orchard Road (a shopping belt for tourists and higher-income Singaporeans).",
        {
            "entities": [
                [
                    42,
                    53,
                    "LOC"
                ],
                [
                    84,
                    96,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "A proposal has further been mooted to extend the line from Bukit Panjang towards Sungei Kadut which will interchange with the North South Line.",
        {
            "entities": [
                [
                    59,
                    72,
                    "LOC"
                ],
                [
                    81,
                    93,
                    "LOC"
                ],
                [
                    122,
                    142,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Situated at the junction of Eu Tong Sen Street, New Bridge Road and Upper Cross Street, the station is near several landmarks, including the Buddha Tooth Relic Temple, Masjid Jamae (Chulia), Chinatown Point and People's Park Complex.",
        {
            "entities": [
                [
                    28,
                    46,
                    "LOC"
                ],
                [
                    48,
                    63,
                    "LOC"
                ],
                [
                    68,
                    86,
                    "LOC"
                ],
                [
                    168,
                    189,
                    "LOC"
                ],
                [
                    191,
                    206,
                    "LOC"
                ],
                [
                    211,
                    232,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "It then curves southwest, passing through Tampines, Bedok and Geylang before intersecting the Kallang-Paya Lebar Expressway and curving northwest, before heading west and running along the southern edge of Toa Payoh.",
        {
            "entities": [
                [
                    42,
                    50,
                    "LOC"
                ],
                [
                    52,
                    57,
                    "LOC"
                ],
                [
                    62,
                    69,
                    "LOC"
                ],
                [
                    94,
                    101,
                    "LOC"
                ],
                [
                    102,
                    112,
                    "LOC"
                ],
                [
                    206,
                    215,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Official sources occasionally refer to the trains of the North South and East West lines as numbered generation trains, with the C151 train being the first and the newest C151C train being the sixth.",
        {
            "entities": [
                [
                    53,
                    68,
                    "LOC"
                ],
                [
                    73,
                    82,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "SingaporeDesigned by Zaha Hadid Architects, the new Science Centre Singapore will be larger than the current centre to house more gallery spaces for thematic exhibitions and enhanced educational facilities such as specialised laboratories for visitors to conduct hands-on experiments and create new inventions.",
        {
            "entities": [
                [
                    52,
                    76,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The tunnels between Cantonment station and the adjacent Prince Edward Road station were constructed only 6.7 metres (22 ft) below the former Tanjong Pagar Railway Station.",
        {
            "entities": [
                [
                    56,
                    74,
                    "LOC"
                ],
                [
                    141,
                    154,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The work was divided into three phases: Phase 1 (Bugis - Tanah Merah), Phase 2 (Joo Koon - Jurong East, Tanah Merah - Pasir Ris) and Phase 3 (Jurong East - Outram Park).",
        {
            "entities": [
                [
                    49,
                    54,
                    "LOC"
                ],
                [
                    57,
                    68,
                    "LOC"
                ],
                [
                    80,
                    88,
                    "LOC"
                ],
                [
                    91,
                    102,
                    "LOC"
                ],
                [
                    104,
                    115,
                    "LOC"
                ],
                [
                    118,
                    127,
                    "LOC"
                ],
                [
                    142,
                    153,
                    "LOC"
                ],
                [
                    156,
                    167,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "When completed in 2024, it will be the second station to have triple island platforms after Jurong East.",
        {
            "entities": [
                [
                    92,
                    103,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Before deciding on the route taken to cross the Singapore River, 20 other tunnel routes were considered by LTA engineers but were deemed too unsafe or too damaging to the environment or both.",
        {
            "entities": [
                [
                    48,
                    63,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "With the recent opening of the fourth terminal, Changi is now capable of handling more than 70 million passengers every year.",
        {
            "entities": [
                [
                    48,
                    54,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The extension will connect commuters between the HarbourFront to Marina Bay stations and expand the rail network to the southern edge of the Central Business District.",
        {
            "entities": [
                [
                    49,
                    61,
                    "LOC"
                ],
                [
                    65,
                    75,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Sembawang station and Kranji station were later included in the construction after the second round of planning (construction began at the same time on 19 November 1992) and Sungei Kadut station was then omitted.",
        {
            "entities": [
                [
                    0,
                    9,
                    "LOC"
                ],
                [
                    22,
                    28,
                    "LOC"
                ],
                [
                    174,
                    186,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The Changi Southern Corridor consists of new roads that will connect Changi Airport Terminal 5 to the East Coast Parkway (ECP) and a widened and realigned Tanah Merah Coast Road.",
        {
            "entities": [
                [
                    4,
                    10,
                    "LOC"
                ],
                [
                    69,
                    83,
                    "LOC"
                ],
                [
                    102,
                    120,
                    "LOC"
                ],
                [
                    155,
                    177,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "In addition to the new platforms, the existing East West line tracks will be extended to connect the line to the new four-in-one East Coast Integrated Depot at Changi.",
        {
            "entities": [
                [
                    47,
                    56,
                    "LOC"
                ],
                [
                    129,
                    139,
                    "LOC"
                ],
                [
                    160,
                    166,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "It commenced operations in three stages, with the initial Bugis to Chinatown segment in 2013, Bukit Panjang to Rochor in 2015 and Fort Canning to Expo in 2017.",
        {
            "entities": [
                [
                    58,
                    63,
                    "LOC"
                ],
                [
                    67,
                    76,
                    "LOC"
                ],
                [
                    94,
                    107,
                    "LOC"
                ],
                [
                    111,
                    117,
                    "LOC"
                ],
                [
                    130,
                    142,
                    "LOC"
                ],
                [
                    146,
                    150,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Within a year, 20 more stations had been added to the network and a direct service existed between Yishun and Lakeside stations, linking up Central Singapore to Jurong in the west by the end of 1988.",
        {
            "entities": [
                [
                    99,
                    105,
                    "LOC"
                ],
                [
                    110,
                    118,
                    "LOC"
                ],
                [
                    140,
                    157,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "\n\nSince Punggol is a young estate, the childcare centre will provide an estimated 500 pre-school places next year.",
        {
            "entities": [
                [
                    8,
                    15,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The district will also feature an integrated transport hub at Bedok South MRT station.",
        {
            "entities": [
                [
                    62,
                    73,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "It will create approximately 28,000 new jobs and offer Punggol residents additional dining, leisure, and retail spots.",
        {
            "entities": [
                [
                    55,
                    62,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The first one is the Northeast Monsoon which occurs from mid-November to early March.",
        {
            "entities": [
                [
                    17,
                    38,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "On 7 March 2019, Hume station was announced to be opened by 2025 to better serve Hillview residents.",
        {
            "entities": [
                [
                    81,
                    89,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "\n\nHome seekers made a beeline for the four-room flats in Hougang, which saw one of the largest number of applicants for a non-mature estate in recent years.",
        {
            "entities": [
                [
                    57,
                    64,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Art in transit : North East Line MRT.",
        {
            "entities": [
                [
                    17,
                    36,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Passing through the Downtown Core, the line interchanges with the North East line at Chinatown station.",
        {
            "entities": [
                [
                    20,
                    33,
                    "LOC"
                ],
                [
                    66,
                    76,
                    "LOC"
                ],
                [
                    85,
                    94,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The single station extension will span 1.6 km (1 mi) and will serve the future Punggol North area.",
        {
            "entities": [
                [
                    79,
                    86,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The precinct is located near King Albert Park MRT station and the Rail Corridor.",
        {
            "entities": [
                [
                    29,
                    45,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "\n\n“Buses were temporarily diverted along Lorong Rusuk towards Lim Chu Kang Road.",
        {
            "entities": [
                [
                    62,
                    79,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The hub will be located opposite Waterway Point, and adjacent to the upcoming Punggol Regional Sports Centre which will be linked via a pedestrian overhead bridge.",
        {
            "entities": [
                [
                    33,
                    47,
                    "LOC"
                ],
                [
                    78,
                    85,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The shifting of the Nicoll Highway station also meant it can no longer serve as a terminus for the Bukit Timah Line, partially influencing the creation of the current Downtown Line.",
        {
            "entities": [
                [
                    20,
                    34,
                    "LOC"
                ],
                [
                    99,
                    110,
                    "LOC"
                ],
                [
                    167,
                    175,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "In the 2008 Land Transport Master Plan, the 1-kilometre (0.6 mi) North South Line extension was announced as one of the upcoming projects rolled out by the Land Transport Authority to expand Singapore's rail network.",
        {
            "entities": [
                [
                    65,
                    81,
                    "LOC"
                ],
                [
                    156,
                    180,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "To improve accessibility and convenience for patients and visitors, facilities with high patient volume such as the new NDCS and NCCS and the new SGH complex will be relocated closer to Outram Park MRT Station.",
        {
            "entities": [
                [
                    186,
                    209,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Sengkang Grand MallA new 3.7-hectare mixed-use development will be built next to Buangkok MRT station.",
        {
            "entities": [
                [
                    0,
                    8,
                    "LOC"
                ],
                [
                    81,
                    89,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "LineThe Downtown Line - A commemorative book by LTA detailing the construction of the DTL",
        {
            "entities": [
                [
                    8,
                    16,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "To enhance pedestrian connectivity, side streets will be redeveloped while elevated link bridges are planned to be built at the junctions of Orchard Road and Patterson Road.",
        {
            "entities": [
                [
                    141,
                    153,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Redevelopment of Singapore Philatelic MuseumCurrently closed for redevelopment works, the Singapore Philatelic Museum will become a dedicated children's museum.",
        {
            "entities": [
                [
                    90,
                    117,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The last stage of the line from Harbourfront to Marina Bay will be completed in 2026, completing the loop.",
        {
            "entities": [
                [
                    32,
                    44,
                    "LOC"
                ],
                [
                    48,
                    58,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "StationsLegendListDepotsRolling stockAs of 2011, the Downtown line has one type of rolling stock, the Bombardier MOVIA C951(A) cars, running in a three-car formation.",
        {
            "entities": [
                [
                    53,
                    61,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "When completed by 2025, Serangoon Polyclinic will be the largest polyclinic in Singapore by floor area.",
        {
            "entities": [
                [
                    24,
                    33,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "During the Southwest Monsoon season, southeast winds prevail.",
        {
            "entities": [
                [
                    7,
                    28,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "On 14 March 2012, platform screen doors became operational at all elevated stations on the North South line.",
        {
            "entities": [
                [
                    91,
                    102,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The new 17-hectare Bird Paradise will allow visitors to observe free-flying birds in their natural habitats at the nine new aviaries themed with different landscapes from around the world, such as wetlands, bamboo forests, and rainforests.",
        {
            "entities": [
                [
                    19,
                    32,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The Land Transport Authority announced that the NSC will be transformed to Singapore's first integrated transport corridor featuring continuous bus lanes and cycling trunk routes, throughout the length of the route.",
        {
            "entities": [
                [
                    4,
                    28,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The entire development will be the first university in South-east Asia to have a multi-energy micro grid network that draws energy from various sources.",
        {
            "entities": [
                [
                    66,
                    70,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The section between Adam Road and Jalan Anak Bukit was opened in October 1976 and construction of the eastern part of the PIE, between Jalan Eunos and Changi Airport, started in 1976.Work was started in November 1977 to expand Whitley Road to six lanes, along with the construction of a grade-separated interchange to link it with the PIE.",
        {
            "entities": [
                [
                    20,
                    29,
                    "LOC"
                ],
                [
                    34,
                    50,
                    "LOC"
                ],
                [
                    135,
                    146,
                    "LOC"
                ],
                [
                    151,
                    165,
                    "LOC"
                ],
                [
                    227,
                    239,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The NEL initially had a higher fare structure compared to the North South and East West lines due to the higher operating costs.",
        {
            "entities": [
                [
                    58,
                    73,
                    "LOC"
                ],
                [
                    78,
                    87,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "In the evening of 22 November, a section of Eu Tong Sen Street collapsed, and it was closed along with neighbouring streets.",
        {
            "entities": [
                [
                    44,
                    62,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "ISBN 9810405731City & The State: Singapore's Built Environment Revisited.",
        {
            "entities": [
                [
                    45,
                    72,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "A review of planning of the Central Area culminated in the Structure Plan in 1984.",
        {
            "entities": [
                [
                    24,
                    40,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "They have been stabled at Gali Batu Depot since it opened with Stage 2 of the downtown line on 27 December 2015.",
        {
            "entities": [
                [
                    26,
                    41,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The North South line (NSL) is a high-capacity Mass Rapid Transit (MRT) line in Singapore, operated by SMRT.",
        {
            "entities": [
                [
                    4,
                    15,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Buangkok station opened on 15 January 2006, and Woodleigh station began operations on 20 June 2011.",
        {
            "entities": [
                [
                    0,
                    8,
                    "LOC"
                ],
                [
                    48,
                    57,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Previously, KTM trains terminated at Tanjong Pagar railway station in central Singapore.",
        {
            "entities": [
                [
                    37,
                    50,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The first flats were launched on 13 November 2018.Punggol 21Punggol 21 is a development initiative that plans to develop the mostly undeveloped town of Punggol into a residential new town.",
        {
            "entities": [
                [
                    152,
                    159,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The two stations, Pioneer and Joo Koon stations, officially opened on 28 February 2009.On 11 January 2011, the Tuas West extension, an extension of the East West line from Joo Koon to Tuas Link was announced.",
        {
            "entities": [
                [
                    18,
                    25,
                    "LOC"
                ],
                [
                    30,
                    38,
                    "LOC"
                ],
                [
                    111,
                    115,
                    "LOC"
                ],
                [
                    152,
                    161,
                    "LOC"
                ],
                [
                    172,
                    180,
                    "LOC"
                ],
                [
                    184,
                    193,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Each day, the first train begins service at approximately 5:15 am (5:35 am on Sundays and public holidays) from Jurong East station to Marina South Pier station.",
        {
            "entities": [
                [
                    112,
                    123,
                    "LOC"
                ],
                [
                    135,
                    152,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "LegendListDepotsInfrastructureRolling stockElectric Multiple Unit (EMU) trains on the North South Line operate in a six-car formation, based out of Bishan Depot and Ulu Pandan Depot, which provides train maintenance, inspection and overhaul facilities.",
        {
            "entities": [
                [
                    82,
                    102,
                    "LOC"
                ],
                [
                    148,
                    160,
                    "LOC"
                ],
                [
                    165,
                    175,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Urban Redevelopment Authority, 1999 ISBN 981-04-1706-3About Us, Urban Redevelopment Authority (URA)Dale, O.J., Urban Planning in Singapore: The Transformation of a City. 1999, New York: Oxford University Press.",
        {
            "entities": [
                [
                    0,
                    29,
                    "LOC"
                ],
                [
                    64,
                    93,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The plan was conceived with the expectation  that Singapore would grow gradually and was unsuited for the social and economic change, rapid population growth and the Central Area's expansion in the early 1960s.",
        {
            "entities": [
                [
                    162,
                    180,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The LTA also built a temporary pedestrian staircase from the shops along New Bridge Road to the Garden Bridge.",
        {
            "entities": [
                [
                    73,
                    88,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Jeremy Sharma, the artist of Holland Beat at Holland Village station, regarded the work as \"original and attractive with a lot of playful humour\".",
        {
            "entities": [
                [
                    45,
                    60,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "SkyHelix SentosaAnnounced by the Singapore Tourism Board on 7 April 2021, SkyHelix Sentosa is an open-air gondola that will rotate and ascend 35 metres above ground.",
        {
            "entities": [
                [
                    33,
                    56,
                    "LOC"
                ],
                [
                    83,
                    90,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The station, which is an infill station with side platforms, was built along an operational section of the line between Sembawang and Yishun.",
        {
            "entities": [
                [
                    120,
                    129,
                    "LOC"
                ],
                [
                    134,
                    140,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The new building, to be built with the S$50 million donation from Ngee Ann Kongsi, will also feature a glass facade that opens out to Rochor Canal Road.",
        {
            "entities": [
                [
                    134,
                    151,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Woodleigh station, built near the former Bidadari cemetery, was scheduled to be opened about seven or eight years after the rest of the NEL opened.",
        {
            "entities": [
                [
                    0,
                    9,
                    "LOC"
                ],
                [
                    41,
                    49,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Upgrading works for the platform were fully completed on 23 May 2009.Under the Land Transport Master Plan 2008, the Jurong East Modification Project entailed the construction of a new platform and the addition of a fourth track to Jurong East station to reduce waiting times and crowding at the station during peak hours.",
        {
            "entities": [
                [
                    116,
                    127,
                    "LOC"
                ],
                [
                    231,
                    242,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The Founders' Memorial will be served by the future Founders' Memorial MRT station on the Thomson-East Coast line, which will be opened in tandem with the development.",
        {
            "entities": [
                [
                    98,
                    108,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The North South Line was upgraded to moving block/CBTC in 2017, and the East West line upgraded in 2018.",
        {
            "entities": [
                [
                    72,
                    81,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "More attention was also paid to conservation, with the Urban Redevelopment Authority (URA) setting aside certain parts of the city centre for conservation in 1986, and announcing the Conservation Master Plan in 1989, under which entire areas in the city centre could be conserved.",
        {
            "entities": [
                [
                    55,
                    84,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The first section, from Bugis to Chinatown station, opened in December 2013, followed by the second section from Bukit Panjang to Rochor station opening in December 2015.",
        {
            "entities": [
                [
                    24,
                    29,
                    "LOC"
                ],
                [
                    33,
                    42,
                    "LOC"
                ],
                [
                    113,
                    126,
                    "LOC"
                ],
                [
                    130,
                    136,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "\n\nBesides offering views of Punggol Town Centre, the rooftop will also feature barbecue pits and a community garden.",
        {
            "entities": [
                [
                    28,
                    47,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The precinct will begin to be developed from 2021.Marina SouthFirst announced as part of the Urban Redevelopment Authority (URA) Master Plan 2014, the future 21.5-hectare Marina South precinct will house over 9,000 private residential units built next to Gardens by the Bay.",
        {
            "entities": [
                [
                    93,
                    122,
                    "LOC"
                ],
                [
                    171,
                    183,
                    "LOC"
                ],
                [
                    255,
                    262,
                    "LOC"
                ],
                [
                    266,
                    274,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Lim Chu Kang Nature Park, and other smaller nature areas.",
        {
            "entities": [
                [
                    0,
                    12,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "It will be Hilton's flagship hotel in Singapore and the largest in the Asia-Pacific region.",
        {
            "entities": [
                [
                    71,
                    75,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "In February 1991, it was further proposed to extend the line to Pulau Tekong via Pulau Ubin.",
        {
            "entities": [
                [
                    81,
                    91,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "An additional extension to the Downtown Line to Sungei Kadut station from Bukit Panjang station was announced on 25 May 2019 by the LTA.",
        {
            "entities": [
                [
                    31,
                    39,
                    "LOC"
                ],
                [
                    48,
                    60,
                    "LOC"
                ],
                [
                    74,
                    87,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Total length of expressways: 164 kmTotal length of major arterial roads: 576 kmTotal length of collector roads: 704 kmTotal length of local access roads: 2056 km (as of 2017)Traffic drives on the left which is typical in Commonwealth countries.",
        {
            "entities": [
                [
                    221,
                    233,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Brickland station will be built between Bukit Gombak and Choa Chu Kang stations, while Sungei Kadut station will be built between Yew Tee and Kranji stations and provide an additional interchange with the Downtown line.",
        {
            "entities": [
                [
                    0,
                    9,
                    "LOC"
                ],
                [
                    40,
                    52,
                    "LOC"
                ],
                [
                    57,
                    70,
                    "LOC"
                ],
                [
                    87,
                    99,
                    "LOC"
                ],
                [
                    130,
                    137,
                    "LOC"
                ],
                [
                    142,
                    148,
                    "LOC"
                ],
                [
                    205,
                    213,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Between the Stadium and Dakota stations, the line parallels Stadium Boulevard and Old Airport Road, then the line continues northwards and follows the route of Paya Lebar Road and Upper Paya Lebar Road between the Paya Lebar (which interchanges with the East West line) and Tai Seng stations.",
        {
            "entities": [
                [
                    12,
                    19,
                    "LOC"
                ],
                [
                    24,
                    30,
                    "LOC"
                ],
                [
                    60,
                    77,
                    "LOC"
                ],
                [
                    82,
                    98,
                    "LOC"
                ],
                [
                    160,
                    175,
                    "LOC"
                ],
                [
                    180,
                    201,
                    "LOC"
                ],
                [
                    214,
                    224,
                    "LOC"
                ],
                [
                    254,
                    263,
                    "LOC"
                ],
                [
                    274,
                    282,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The new 91,000 square-metre centralised campus in Punggol will have a capacity of up to 12,000 students.",
        {
            "entities": [
                [
                    50,
                    57,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "That is the address of J Gateway condominium.",
        {
            "entities": [
                [
                    23,
                    32,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Phase 1 includes new developments such as the already-completed Outram Community Hospital, SGH Accident & Emergency Block, SGH Elective Care Centre, a new National Dental Centre Singapore (NDCS), and a new National Cancer Centre Singapore (NCCS).",
        {
            "entities": [
                [
                    64,
                    89,
                    "LOC"
                ],
                [
                    155,
                    177,
                    "LOC"
                ],
                [
                    206,
                    238,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "There will also be Therapeutic Gardens in between the healthcare blocks.",
        {
            "entities": [
                [
                    19,
                    38,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Downtown Line 3 Extension (DTLe)To be completed by 2024, the extension will run from Expo and through East Coast area, from Xilin to Sungei Bedok.",
        {
            "entities": [
                [
                    0,
                    8,
                    "LOC"
                ],
                [
                    85,
                    89,
                    "LOC"
                ],
                [
                    102,
                    112,
                    "LOC"
                ],
                [
                    124,
                    129,
                    "LOC"
                ],
                [
                    140,
                    145,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "In Jurong East, more than 11 first-time applicants will compete for each of the 240 four-room units.",
        {
            "entities": [
                [
                    3,
                    14,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Tampines NorthFirst announced on 29 August 2013, Tampines North is a new 240-hectare residential estate in the existing Tampines town.",
        {
            "entities": [
                [
                    0,
                    8,
                    "LOC"
                ],
                [
                    49,
                    63,
                    "LOC"
                ],
                [
                    120,
                    128,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The site was the last available Government Land Sales (GLS) site along the prime stretch of the Singapore River.",
        {
            "entities": [
                [
                    96,
                    111,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The Johor-Singapore Causeway, built in the 1920s to connect Johor Bahru in Johor, Malaysia to Woodlands in Singapore, carries a road and a railway line.",
        {
            "entities": [
                [
                    94,
                    103,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Bukit Canberra will be the second such community hub in Singapore, after Our Tampines Hub in Tampines.",
        {
            "entities": [
                [
                    73,
                    89,
                    "LOC"
                ],
                [
                    93,
                    101,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "In addition, service roads were constructed along the expressway near Toa Payoh and at the Woodsville interchange.",
        {
            "entities": [
                [
                    70,
                    79,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "LineThe 50-kilometre (31 mi) Cross Island line is expected to span the island of Singapore, passing through Tuas, Jurong, Sin Ming, Ang Mo Kio, Hougang, Punggol, Pasir Ris, and Changi.",
        {
            "entities": [
                [
                    29,
                    41,
                    "LOC"
                ],
                [
                    108,
                    112,
                    "LOC"
                ],
                [
                    132,
                    142,
                    "LOC"
                ],
                [
                    144,
                    151,
                    "LOC"
                ],
                [
                    153,
                    160,
                    "LOC"
                ],
                [
                    162,
                    171,
                    "LOC"
                ],
                [
                    177,
                    183,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Passenger transportWater transport within the main island is limited to the River Taxi along the Singapore River.",
        {
            "entities": [
                [
                    97,
                    112,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "HistoryNorth East line station (1996–2003)Chinatown station was first announced as People's Park station, along with the 15 other North East line (NEL) stations, by Communications Minister",
        {
            "entities": [
                [
                    0,
                    17,
                    "LOC"
                ],
                [
                    83,
                    96,
                    "LOC"
                ],
                [
                    130,
                    140,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "West Coast extensionBesides the original announced alignment of the line, a West Coast extension to the Circle Line from the Jurong Region Line is currently under study, linking the West Coast region directly to Haw Par Villa, and allowing commuters on the Jurong Region line access to the central area of the city easily.",
        {
            "entities": [
                [
                    0,
                    10,
                    "LOC"
                ],
                [
                    76,
                    86,
                    "LOC"
                ],
                [
                    182,
                    192,
                    "LOC"
                ],
                [
                    212,
                    225,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The existing S.E.A. Aquarium will expand thrice its current size and be rebranded as the Singapore Oceanarium.",
        {
            "entities": [
                [
                    13,
                    28,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "LineThe 43-kilometre (27 mi), 32 station fully underground Thomson–East Coast Line is designed to connect the northern region of Singapore to the south, running parallel to the existing North South line passing through Woodlands, Sin Ming, Upper Thomson, and Marina Bay before turning east and running through Tanjong Rhu, Siglap, Marine Parade, and Bedok.",
        {
            "entities": [
                [
                    67,
                    77,
                    "LOC"
                ],
                [
                    186,
                    197,
                    "LOC"
                ],
                [
                    219,
                    228,
                    "LOC"
                ],
                [
                    240,
                    253,
                    "LOC"
                ],
                [
                    259,
                    269,
                    "LOC"
                ],
                [
                    310,
                    321,
                    "LOC"
                ],
                [
                    323,
                    329,
                    "LOC"
                ],
                [
                    331,
                    344,
                    "LOC"
                ],
                [
                    350,
                    355,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "This area is in Bukit Gombak.",
        {
            "entities": [
                [
                    16,
                    28,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "On 20 May 1999, SBS Transit (then Singapore Bus Service Ltd) was appointed to operate the line along with the Sengkang and Punggol LRT systems.",
        {
            "entities": [
                [
                    110,
                    118,
                    "LOC"
                ],
                [
                    123,
                    130,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Continuous service between Pasir Ris and Gul Circle resumed on 28 May 2018, with the permanent activation of the new CBTC system; since the incident, selected portions of either North South or East West line were to conduct track renewal works with early weekend closures and later station openings.",
        {
            "entities": [
                [
                    27,
                    36,
                    "LOC"
                ],
                [
                    41,
                    51,
                    "LOC"
                ],
                [
                    178,
                    189,
                    "LOC"
                ],
                [
                    193,
                    202,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The first section of the line, Stage 3, a 5 kilometres (3.1 mi) five-station segment stretching from Bartley to Marymount, opened on 28 May 2009.",
        {
            "entities": [
                [
                    101,
                    108,
                    "LOC"
                ],
                [
                    112,
                    121,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "There are also daily scheduled ferry services from the Marina South Pier to the Southern Islands such as Kusu Island, Lazarus Island & Saint John's Island and Sisters' Islands.",
        {
            "entities": [
                [
                    55,
                    72,
                    "LOC"
                ],
                [
                    80,
                    96,
                    "LOC"
                ],
                [
                    105,
                    116,
                    "LOC"
                ],
                [
                    135,
                    154,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "On the opening day, however, several commuters alighted at Woodleigh station by accident, having intended to alight at the adjacent Serangoon station and being unaware that Woodleigh had opened.",
        {
            "entities": [
                [
                    59,
                    68,
                    "LOC"
                ],
                [
                    132,
                    141,
                    "LOC"
                ],
                [
                    173,
                    182,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Tengah Depot will house the JRL Operations Control Centre and have a bus depot integrated with it to optimise land use.",
        {
            "entities": [
                [
                    0,
                    6,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "In total, there are three local airlines, all operating out of Changi Airport:Jetstar Asia AirwaysScootSingapore AirlinesMalaysia's Firefly is the sole operator with scheduled services out of Seletar Airport.",
        {
            "entities": [
                [
                    63,
                    77,
                    "LOC"
                ],
                [
                    192,
                    207,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "controlThe Downtown line is equipped with Siemens (previously Invensys before Siemens acquisition)",
        {
            "entities": [
                [
                    11,
                    19,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "They were first installed at Jurong East, Pasir Ris, and Yishun stations in 2009 as trial runs.",
        {
            "entities": [
                [
                    29,
                    40,
                    "LOC"
                ],
                [
                    42,
                    51,
                    "LOC"
                ],
                [
                    57,
                    63,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "As the section of track between Pioneer and Joo Koon support 'mixed-mode' of both signalling systems, trains terminating at either Joo Koon or Tuas Link would have to change signalling modes at Pioneer MRT station as trains terminating at Joo Koon would proceed to a turn back siding which was built as part of the TWE which only supports the new signalling system.",
        {
            "entities": [
                [
                    32,
                    39,
                    "LOC"
                ],
                [
                    44,
                    52,
                    "LOC"
                ],
                [
                    131,
                    139,
                    "LOC"
                ],
                [
                    143,
                    152,
                    "LOC"
                ],
                [
                    194,
                    201,
                    "LOC"
                ],
                [
                    239,
                    247,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The existing private golf club will be replaced by approximately 9,000 Housing and Development Board (HDB) and private residential units when its lease expires in 2021.Public housing units in the prime area will be using a new pricing model to lessen the effect where owners sell their units at much higher prices than initially purchased at subsidised rates from the Housing and Development Board (HDB).BidadariFirst announced on 29 August 2013, Bidadari is a new 93-hectare residential estate near Serangoon.",
        {
            "entities": [
                [
                    447,
                    455,
                    "LOC"
                ],
                [
                    500,
                    509,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The redeveloped industrial park will be renamed Defu Industrial Park.",
        {
            "entities": [
                [
                    48,
                    68,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "In the west there is a road bridge (Tuas Second Link), which connects to Johor, for road traffic only.",
        {
            "entities": [
                [
                    36,
                    40,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Construction for Stage 2 began on 3 July 2009 with a groundbreaking ceremony at Beauty World station.",
        {
            "entities": [
                [
                    80,
                    92,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "With bus operations in the area handed over from Trans-Island Bus Services (TIBS) to the newly appointed operator, SBS then had control over both bus and rail services in the northeast, allowing the inter-modal integration that the government aimed for.",
        {
            "entities": [
                [
                    49,
                    74,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Train services between Tuas Link and Joo Koon stations were temporally suspended on both directions for two hours on the day itself and the entire day on 16 November 2017, resulting that the westbound trains would temporarily terminate at Joo Koon.",
        {
            "entities": [
                [
                    23,
                    32,
                    "LOC"
                ],
                [
                    37,
                    45,
                    "LOC"
                ],
                [
                    239,
                    247,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Also, Kampong Chantek Bahru, off of Bukit Timah Road, was cleared to make way for the expressway.",
        {
            "entities": [
                [
                    36,
                    52,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Civil DefenceWith the exception of three stations (Dhoby Ghaut, Sengkang and Punggol), the NEL stations are designated as Civil Defence (CD) shelters.",
        {
            "entities": [
                [
                    51,
                    62,
                    "LOC"
                ],
                [
                    64,
                    72,
                    "LOC"
                ],
                [
                    77,
                    84,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "A video of the incident circulating on social media showed the man crossing the street towards the police centre at Clementi Ave 5 with what appears to be a knife in his hand while police officers point their firearms at him.",
        {
            "entities": [
                [
                    116,
                    124,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "It has an exclusive economic zone of 1,067 km2 (412 sq mi).Singapore is separated from Indonesia by the Singapore Strait and from Malaysia by the Straits of Johor.",
        {
            "entities": [
                [
                    100,
                    120,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "A realignment to the Marina Bay Street Circuit, particularly the 300-metre stretch from Turns 16 to 19 along the floating platform, will also have to be carried out.",
        {
            "entities": [
                [
                    21,
                    31,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "One person was taken to hospital for burn injuries and smoke inhalation after a fire broke out at a condominium unit in Jurong East on Saturday afternoon (Dec 18).",
        {
            "entities": [
                [
                    120,
                    131,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Crucially, the plan divided Singapore into several ethnic subdivisions, the Europeans, Malays, Chinese, Indians, Arabs and Bugis were placed in separate ethnic enclaves.",
        {
            "entities": [
                [
                    123,
                    128,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "To connect this section to the rest of the PIE, a $15.2 million viaduct over Jalan Anak Bukit and Upper Bukit Timah Road was built.",
        {
            "entities": [
                [
                    77,
                    93,
                    "LOC"
                ],
                [
                    98,
                    120,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "It will be a major waterfront district with recreational and tourism facilities/amenities while offering seamless \"fly-ferry\" connections between Changi Airport Terminal 5 and Tanah Merah Ferry Terminal due to their close proximity to one another.",
        {
            "entities": [
                [
                    146,
                    160,
                    "LOC"
                ],
                [
                    176,
                    202,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The special village will be built on a site in Gibraltar Crescent near Sembawang Park.",
        {
            "entities": [
                [
                    47,
                    65,
                    "LOC"
                ],
                [
                    71,
                    85,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Due to the expansion, a new facade featuring reflective glass panels angled towards and reflecting the existing dome of the original heritage main building will be seen from Bras Basah Road.",
        {
            "entities": [
                [
                    174,
                    189,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "From Promenade station, the line goes northwards and towards the east, passing beneath the Kallang Basin.",
        {
            "entities": [
                [
                    5,
                    14,
                    "LOC"
                ],
                [
                    91,
                    98,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "In addition, this station site is closely linked to shopping centres and busy pedestrian areas, such as Chinatown Point, Hong Lim Complex, People's Park Complex and The Majestic.",
        {
            "entities": [
                [
                    104,
                    119,
                    "LOC"
                ],
                [
                    121,
                    137,
                    "LOC"
                ],
                [
                    139,
                    160,
                    "LOC"
                ],
                [
                    165,
                    177,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "During the Northeast Monsoon, northeast winds prevail, sometimes reach 20 km/h (12 mph).",
        {
            "entities": [
                [
                    7,
                    28,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Art in transit : North East Line MRT.",
        {
            "entities": [
                [
                    17,
                    36,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The Expo and Changi Airport stations were opened on 10 January 2001 and 8 February 2002 respectively.",
        {
            "entities": [
                [
                    4,
                    8,
                    "LOC"
                ],
                [
                    13,
                    27,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Originally planned as three separate lines, the lines merged into the Downtown Line in 2007 and construction began in three stages.",
        {
            "entities": [
                [
                    70,
                    78,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "ReferencesExternal linksNorth South line",
        {
            "entities": [
                [
                    30,
                    35,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Between Khatib and Yio Chu Kang stations parallel to Lentor Avenue, the line continues at surface level; this section is the longest distance between any two MRT stations in Singapore.",
        {
            "entities": [
                [
                    8,
                    14,
                    "LOC"
                ],
                [
                    19,
                    31,
                    "LOC"
                ],
                [
                    53,
                    66,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The East West line was constructed along the North South line.",
        {
            "entities": [
                [
                    4,
                    13,
                    "LOC"
                ],
                [
                    45,
                    56,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "A branch line to Bishan Depot exists between the Ang Mo Kio and Bishan stations.",
        {
            "entities": [
                [
                    17,
                    29,
                    "LOC"
                ],
                [
                    49,
                    59,
                    "LOC"
                ],
                [
                    64,
                    70,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "After Bishan, the line goes underground through the Central Area.",
        {
            "entities": [
                [
                    6,
                    12,
                    "LOC"
                ],
                [
                    48,
                    64,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "As the original platform, now serving northbound trains to Jurong East, remained in service, upgrading works for the platform (Platform A) was hindered and took about a year to complete.",
        {
            "entities": [
                [
                    59,
                    70,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Changi Point Ferry Terminal in the east offers daily ferry services to Pulau Ubin and some destinations in Johor, Malaysia.",
        {
            "entities": [
                [
                    0,
                    27,
                    "LOC"
                ],
                [
                    71,
                    81,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "It will open in phases, with the entire development expected to be fully operational by September 2021.One PunggolCurrently under construction, the 42,300 square-metre One Punggol in Punggol will feature a 700-seat hawker centre and the Punggol Regional Library among a variety of other amenities such as the revamped Punggol Vista Community Centre, a childcare centre, and multiple healthcare service centres.",
        {
            "entities": [
                [
                    172,
                    179,
                    "LOC"
                ],
                [
                    183,
                    190,
                    "LOC"
                ],
                [
                    237,
                    244,
                    "LOC"
                ],
                [
                    318,
                    348,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Expo station, located on the Changi Airport branch of the East West Line, is adjacent to the 100,000-square-metre Singapore Expo exhibition facility.",
        {
            "entities": [
                [
                    0,
                    4,
                    "LOC"
                ],
                [
                    29,
                    43,
                    "LOC"
                ],
                [
                    54,
                    72,
                    "LOC"
                ],
                [
                    114,
                    128,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "At Queen's Arc in Queenstown, close to five first-time applicants will be competing for each of the 534 four-room flats, despite the project having the longest wait time of more than five years.",
        {
            "entities": [
                [
                    18,
                    28,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Besides escalators, Dhoby Ghaut station is the first MRT station to feature a set of 55 metres (180 ft) travellators that links between the NEL and NSL platforms.",
        {
            "entities": [
                [
                    20,
                    31,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The Pan Island Expressway (Abbreviated as: PIE) is the oldest and longest expressway in Singapore.",
        {
            "entities": [
                [
                    4,
                    25,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "A team of data scientists explored the data and discovered via a Marey Chart visualization that it was caused by hardware problems, sending errant signals from a \"rogue\" train, PV46.Network and operationsRouteThe 35.5-kilometre (22.1 mi) Circle line forms an incomplete loop from Dhoby Ghaut in the Central Region of Singapore, north to Serangoon and Bishan, and south to HarbourFront, with a branch from Promenade to Marina Bay station which will be extended to HarbourFront in the future.",
        {
            "entities": [
                [
                    280,
                    291,
                    "LOC"
                ],
                [
                    337,
                    346,
                    "LOC"
                ],
                [
                    351,
                    357,
                    "LOC"
                ],
                [
                    372,
                    384,
                    "LOC"
                ],
                [
                    405,
                    414,
                    "LOC"
                ],
                [
                    418,
                    428,
                    "LOC"
                ],
                [
                    463,
                    475,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Rebranding of Hilton SingaporeHilton Singapore will be rebranded as voco Orchard Singapore when it opens in January 2022.",
        {
            "entities": [
                [
                    73,
                    80,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Three regional centres were also added to the mix, with Tampines, Jurong East and Woodlands supported by an expansive train network which provides links to places island-wide.",
        {
            "entities": [
                [
                    56,
                    64,
                    "LOC"
                ],
                [
                    66,
                    77,
                    "LOC"
                ],
                [
                    82,
                    91,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Integration of Bugis Village and Bugis StreetAnnounced on 16 January 2020, CapitaLand has won a three-year tender for the integrated management of Bugis Village and adjacent Bugis Street.",
        {
            "entities": [
                [
                    15,
                    28,
                    "LOC"
                ],
                [
                    33,
                    38,
                    "LOC"
                ],
                [
                    147,
                    160,
                    "LOC"
                ],
                [
                    174,
                    179,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "After deciding on a rail-based system, the construction of Phase I of the MRT system, which will be the North South line, was given priority as the line passes through areas having a higher demand for public transport, such as the densely populated housing estates of Toa Payoh and Ang Mo Kio and the Central Area.",
        {
            "entities": [
                [
                    104,
                    115,
                    "LOC"
                ],
                [
                    268,
                    277,
                    "LOC"
                ],
                [
                    282,
                    292,
                    "LOC"
                ],
                [
                    297,
                    313,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "In late 2004, several parts of Asia and Africa were struck by the 2004 Indian Ocean earthquake and the resulting tsunami.",
        {
            "entities": [
                [
                    31,
                    35,
                    "LOC"
                ],
                [
                    40,
                    46,
                    "LOC"
                ],
                [
                    71,
                    83,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The new Shaw Tower is scheduled to be completed by 2023.Redevelopment of Pan Pacific OrchardClosed for redevelopment in April 2018, the 23-storey Pan Pacific Orchard will feature four levels of soaring gardens.",
        {
            "entities": [
                [
                    158,
                    165,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The direct service was eventually split into the North South and East West lines after the latter's completion of the eastern sector to Tanah Merah station.",
        {
            "entities": [
                [
                    45,
                    60,
                    "LOC"
                ],
                [
                    65,
                    74,
                    "LOC"
                ],
                [
                    136,
                    147,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Woodleigh station features one of the longest sets of escalators at 38.5 metres (126 ft).",
        {
            "entities": [
                [
                    0,
                    9,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The system is managed in conformance with a semi-nationalised hybrid regulatory framework; construction and procurement fall under the purview of the Land Transport Authority (LTA), a statutory board that allocates operating concessions to the for-profit private corporations SMRT and SBS Transit.",
        {
            "entities": [
                [
                    150,
                    174,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "On 7 October 2017, a dilapidated float and pump system at Bishan station caused a tunnel flood after heavy torrential rainstorms.",
        {
            "entities": [
                [
                    58,
                    64,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "As a result, commercial houses and wharves grew disorderly along the banks of the Singapore River, a location known for its accessibility to trading boats.",
        {
            "entities": [
                [
                    82,
                    97,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "HarbourFront station, being located by the sea, has a maritime theme with the ship hull elliptical motif used for the ceiling and the concourse openings to the platforms.",
        {
            "entities": [
                [
                    0,
                    12,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "For the July 2015 disruption, LTA imposed a higher penalty of S$5.4 million on SMRT.On 22 March 2016, a fatal accident occurred off Pasir Ris station.",
        {
            "entities": [
                [
                    132,
                    141,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The Eastern Gateway, bolstered by the recent opening of Jewel Changi Airport and the expansion of Changi Air Hub, will continue to be a gateway for Singapore to the rest of the world.",
        {
            "entities": [
                [
                    56,
                    76,
                    "LOC"
                ],
                [
                    98,
                    104,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Getting there : The story of the North East Line.",
        {
            "entities": [
                [
                    29,
                    48,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Planning and census boundaries, called planning areas, have been used by the Urban Redevelopment Authority to define certain districts and neighbourhoods, although these boundaries may not necessarily correspond with the common perception of a certain place.",
        {
            "entities": [
                [
                    77,
                    106,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Also in February that year, the Land Transport Authority announced that the capacity of the depot will be expanded to stable 81 trains by 2019.FutureOn 17 January 2013, plans were announced for a southern extension extending from Expo to connect with the Eastern Region line (ERL); the ERL has since been subsumed into the Thomson-East Coast line.",
        {
            "entities": [
                [
                    32,
                    56,
                    "LOC"
                ],
                [
                    230,
                    234,
                    "LOC"
                ],
                [
                    255,
                    269,
                    "LOC"
                ],
                [
                    331,
                    341,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The former Admiralty House will also be restored as part of the plans.",
        {
            "entities": [
                [
                    11,
                    20,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The northwest of Punggol will be developed and the West Loop of the Punggol LRT Line will be in operation, serving the area.",
        {
            "entities": [
                [
                    17,
                    24,
                    "LOC"
                ],
                [
                    47,
                    60,
                    "LOC"
                ],
                [
                    68,
                    75,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Most of the work will be completed by 2026, with the remainder by 2029, in conjunction with the Cross Island MRT line stations in the surrounding area.",
        {
            "entities": [
                [
                    96,
                    108,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The highest point of Singapore is Bukit Timah Hill, with a height from ground of 165 m (538 ft) and made up of igneous rock, granite.",
        {
            "entities": [
                [
                    34,
                    45,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Political and human geographyWhen Singapore was first colonized by the British, the City of Singapore was situated on the southern coast, around the mouth of the Singapore River.",
        {
            "entities": [
                [
                    162,
                    177,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Dhoby Ghaut will primarily be a lush greenery zone with attractions that are targeted at families.",
        {
            "entities": [
                [
                    0,
                    11,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Both the substation and commercial building are scheduled to be completed in 2024.Tuas NexusCurrently under construction at a site next to the Tuas Water Reclamation Plant in Tuas View Basin, Tuas Nexus is an integrated waste management facility.",
        {
            "entities": [
                [
                    143,
                    147,
                    "LOC"
                ],
                [
                    175,
                    184,
                    "LOC"
                ],
                [
                    192,
                    196,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "These expressways include:Ayer Rajah Expressway (AYE)Bukit Timah Expressway (BKE)Central Expressway (CTE)East Coast Parkway (ECP)Marina Coastal Expressway (MCE)Kallang–Paya Lebar Expressway (KPE)Kranji Expressway (KJE)Pan Island Expressway (PIE)Seletar Expressway (SLE)Tampines Expressway (TPE)North–South Corridor (scheduled opening in 2026)The influence of expressways on Singapore's transport policy developed shortly after independence during the history of Singapore because of frequent traffic congestion in the Central district.",
        {
            "entities": [
                [
                    77,
                    99,
                    "LOC"
                ],
                [
                    168,
                    178,
                    "LOC"
                ],
                [
                    300,
                    314,
                    "LOC"
                ],
                [
                    518,
                    525,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Clementi train collisionOn 5 August 1993, before opening, a maintenance vehicle spilt oil on the tracks between Clementi and Jurong East.",
        {
            "entities": [
                [
                    0,
                    8,
                    "LOC"
                ],
                [
                    112,
                    120,
                    "LOC"
                ],
                [
                    125,
                    136,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "It is between the Buangkok and Sengkang stations.",
        {
            "entities": [
                [
                    18,
                    26,
                    "LOC"
                ],
                [
                    31,
                    39,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The campus, estimated to cost more than S$1 billion, is expected to be completed by 2023.Ngee Ann Kongsi Building (Expansion of LASALLE College of the Arts)A new S$50 million, 20,000 square-metre 12-storey block, directly connected to Rochor MRT station, will be built on a 6,000 square-metre site adjacent to the existing LASALLE College of the Arts McNally Street campus to centralise the school's facilities.",
        {
            "entities": [
                [
                    235,
                    241,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Brickland and Sungei Kadut MRT stationsTwo new stations are planned along the existing North South Line.",
        {
            "entities": [
                [
                    0,
                    9,
                    "LOC"
                ],
                [
                    14,
                    26,
                    "LOC"
                ],
                [
                    87,
                    103,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "In Orchard, more mixed-use developments will be constructed on empty plots of land along Orchard Boulevard above Orchard MRT station.",
        {
            "entities": [
                [
                    3,
                    10,
                    "LOC"
                ],
                [
                    89,
                    106,
                    "LOC"
                ],
                [
                    113,
                    120,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The Tengah Depot for the Jurong Region Line will be situated at the western perimeter of Tengah, and an additional depot facility will be added near Peng Kang Hill station to support the operations of the JRL.",
        {
            "entities": [
                [
                    4,
                    10,
                    "LOC"
                ],
                [
                    89,
                    95,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "While tunneling works were completed on 13 November 2020, transport minister Ong Ye Kung announced that Punggol Coast station's completion would be delayed to 2024 due to delays from the COVID-19 pandemic.",
        {
            "entities": [
                [
                    104,
                    111,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Impact and expansionsUpon its opening, the Pan Island Expressway had a positive impact on traffic flow in certain areas by alleviating traffic, as was reported by a preliminary Public Works Department study in October 1981.",
        {
            "entities": [
                [
                    43,
                    64,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Construction challenges on the line include having to divert the Eu Tong Seng canal into pipes for the construction of Chinatown station and having to avoid flooding the tunnels and station while boring the tunnels underneath the Singapore River between the Clarke Quay and Dhoby Ghaut stations.",
        {
            "entities": [
                [
                    119,
                    128,
                    "LOC"
                ],
                [
                    230,
                    245,
                    "LOC"
                ],
                [
                    258,
                    269,
                    "LOC"
                ],
                [
                    274,
                    285,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Passing underneath the Singapore River and Fort Canning Hill to Dhoby Ghaut station, the NEL continues north to Little India station, cutting underneath Bukit Timah Road.",
        {
            "entities": [
                [
                    23,
                    38,
                    "LOC"
                ],
                [
                    43,
                    55,
                    "LOC"
                ],
                [
                    64,
                    75,
                    "LOC"
                ],
                [
                    112,
                    124,
                    "LOC"
                ],
                [
                    153,
                    169,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "HeliportsAerial lift transportCable carThe Singapore Cable Car is a three-station gondola lift system that plies between Mount Faber on the main island of Singapore and the resort island of Sentosa via HarbourFront.",
        {
            "entities": [
                [
                    43,
                    62,
                    "LOC"
                ],
                [
                    127,
                    132,
                    "LOC"
                ],
                [
                    190,
                    197,
                    "LOC"
                ],
                [
                    202,
                    214,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Key infrastructure developments included the new international Changi Airport, a mass rapid transit system, and a new expressway system.",
        {
            "entities": [
                [
                    63,
                    77,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Woodlands extensionAfter the Branch line (from the Jurong East to Choa Chu Kang stations) opened in 1990, the Woodlands MRT line was envisioned so as to close the gap between Yishun and Choa Chu Kang stations.",
        {
            "entities": [
                [
                    0,
                    9,
                    "LOC"
                ],
                [
                    51,
                    62,
                    "LOC"
                ],
                [
                    66,
                    79,
                    "LOC"
                ],
                [
                    110,
                    119,
                    "LOC"
                ],
                [
                    175,
                    181,
                    "LOC"
                ],
                [
                    186,
                    199,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The project is named Guoco Midtown II, with the residential component named Midtown Modern.",
        {
            "entities": [
                [
                    21,
                    34,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "However, the Public Transport Council (PTC) announced in 2016 that fares for the three underground lines would be reduced to match those on the NSEWL, which took effect along with the yearly-applied fare changes, on 30 December 2016.After the opening of Downtown line Stage 3, Transport Minister Khaw Boon Wan announced that public transport fare rules will be reviewed to allow for transfers across MRT lines at different stations due to the increasing density of the rail network.",
        {
            "entities": [
                [
                    13,
                    37,
                    "LOC"
                ],
                [
                    254,
                    262,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Between the Potong Pasir and Kovan stations, the line parallels Upper Serangoon Road before curving north to Hougang station.",
        {
            "entities": [
                [
                    12,
                    24,
                    "LOC"
                ],
                [
                    29,
                    34,
                    "LOC"
                ],
                [
                    64,
                    84,
                    "LOC"
                ],
                [
                    109,
                    116,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Despite some opposition, the Land Transport Authority proceeded with the construction to serve commuters along Singapore Polytechnic with Dover housing estate.",
        {
            "entities": [
                [
                    29,
                    53,
                    "LOC"
                ],
                [
                    111,
                    132,
                    "LOC"
                ],
                [
                    138,
                    143,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Punggol Coast, the seventeenth station on the line, will open in 2024.",
        {
            "entities": [
                [
                    0,
                    7,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "A new air-conditioned platform to serve southbound trains to Marina South Pier was constructed and opened for service on 27 July 2008.",
        {
            "entities": [
                [
                    61,
                    78,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Johor Bahru-Singapore Rapid Transit System (RTS)The Johor Bahru-Singapore Rapid Transit System (RTS) is an upcoming 4 km cross-border light-rail link between Bukit Changar in Johor Bahru and Woodlands North MRT station in Singapore.",
        {
            "entities": [
                [
                    191,
                    206,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "For this disruption that brought inconvenience to 413,000 commuters, LTA imposed a 'record' fine of S$5.4 million on SMRT.22 March 2016 staff fatalitiesAt about 11.08 am on 22 March 2016, two SMRT track-maintenance trainee staff were killed after a C151 train approaching Pasir Ris station ran over them, resulting in a temporarily service delay between Tanah Merah and Pasir Ris for about 2.5 hours and affected at least 10,000 commuters.",
        {
            "entities": [
                [
                    272,
                    281,
                    "LOC"
                ],
                [
                    354,
                    365,
                    "LOC"
                ],
                [
                    370,
                    379,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Redevelopment of Alexandra HospitalAnnounced on 5 March 2020, Alexandra Hospital will be redeveloped and expanded from 12.2 hectares to 13.1 hectares.",
        {
            "entities": [
                [
                    62,
                    80,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "From Marina South Pier station, the first train going to Jurong East station begins service at 6:10 am (approximately 6:40 am on Sundays and public holidays).",
        {
            "entities": [
                [
                    5,
                    22,
                    "LOC"
                ],
                [
                    57,
                    68,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "After Geylang Bahru station, the line continues in a general eastwards direction, through the industrial areas of Kampong Ubi and Kaki Bukit (briefly paralleling Ubi Avenue 2 and Kaki Bukit Avenue 1), before continuing towards the Tampines Regional Centre and goes southwards, ending at Changi Business Park.",
        {
            "entities": [
                [
                    6,
                    19,
                    "LOC"
                ],
                [
                    114,
                    125,
                    "LOC"
                ],
                [
                    130,
                    140,
                    "LOC"
                ],
                [
                    162,
                    174,
                    "LOC"
                ],
                [
                    179,
                    198,
                    "LOC"
                ],
                [
                    231,
                    239,
                    "LOC"
                ],
                [
                    287,
                    293,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Residents staying on the second floor of Block 220 Jurong East Street 21 were apparently facing quite a stink.",
        {
            "entities": [
                [
                    47,
                    72,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The first ten eastbound trains reported braking problems, then the eleventh train from Jurong stopped at the Clementi station for two minutes longer than scheduled due to it using its emergency brakes to stop at the station at 7.50 am, before being hit by another eastbound train when it failed to stop in time.",
        {
            "entities": [
                [
                    109,
                    117,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The centre will be catered to a wide range of competitive sporting events and will be integrated with the Punggol Waterway and co-located with the existing SAFRA Punggol clubhouse.",
        {
            "entities": [
                [
                    106,
                    113,
                    "LOC"
                ],
                [
                    162,
                    169,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "11 stations, from Braddell to Marina South Pier are underground, with the rest being ground-level or elevated.",
        {
            "entities": [
                [
                    18,
                    26,
                    "LOC"
                ],
                [
                    30,
                    47,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Singapore: Land Transport Authority.",
        {
            "entities": [
                [
                    11,
                    35,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The 21 third-generation C751B trains was introduced during the Changi Airport extension to complement the existing 66 first-generation C151 trains and 19 second-generation C651 trains.",
        {
            "entities": [
                [
                    63,
                    77,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "During the construction, traffic was diverted to Cross Street and Upper Cross Street from March 2007 to the end of June 2008.",
        {
            "entities": [
                [
                    49,
                    61,
                    "LOC"
                ],
                [
                    66,
                    84,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Both the North South and the East West lines utilized identical rolling stock up until the recent years, when the C151A trains was temporary suspended from operating on the North South Line from January 2012 until November 2013 following the 2011 Train Disruptions.",
        {
            "entities": [
                [
                    5,
                    20,
                    "LOC"
                ],
                [
                    29,
                    38,
                    "LOC"
                ],
                [
                    169,
                    189,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The development is expected to be completed by 2023.The Reef at King's DockDeveloped by Mapletree and Keppel Land, The Reef at King's Dock is a 429-unit condominium currently being built at Keppel Bay in Harbourfront.",
        {
            "entities": [
                [
                    115,
                    123,
                    "LOC"
                ],
                [
                    204,
                    216,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Numerous changes were made to the number of stations for the extension mainly to accommodate the 1991 Concept Plan by the Urban Redevelopment Authority, which aimed to make Woodlands a regional centre for northern Singapore.",
        {
            "entities": [
                [
                    122,
                    151,
                    "LOC"
                ],
                [
                    173,
                    182,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The estate will also house a mixed-use development named The Woodleigh Residences and The Woodleigh Mall.",
        {
            "entities": [
                [
                    57,
                    81,
                    "LOC"
                ],
                [
                    86,
                    104,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Measures were put in place by the Public Transport Security Committee to enhance depot security in light of the first incident, but works were yet to be completed by SMRT Corporation when the second incident, on 17 August 2011, occurred at Bishan Depot.",
        {
            "entities": [
                [
                    240,
                    252,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Developed by CapitaLand, Ascott REIT and City Developments Limited, the redeveloped complex will open in phases from 2024.The development will be directly linked underground to the Fort Canning MRT station.",
        {
            "entities": [
                [
                    181,
                    193,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "However, since the 1960s the government has constructed many new towns in other areas, so that today the island is nearly entirely built-up and urbanised, with only a few exceptions, such as the district of Lim Chu Kang or reclaimed land in the process of being developed.",
        {
            "entities": [
                [
                    207,
                    219,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The station serves public amenities including the State Courts, Family Justice Courts, Chinatown Visitor Centre and the Kreta Ayer Community Centre.",
        {
            "entities": [
                [
                    50,
                    62,
                    "LOC"
                ],
                [
                    64,
                    85,
                    "LOC"
                ],
                [
                    87,
                    111,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "By 2040, the Changi Airport line (CAL) will be converted to the Thomson-East Coast line.",
        {
            "entities": [
                [
                    13,
                    27,
                    "LOC"
                ],
                [
                    72,
                    82,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Land acquisitions affecting parts of the Laguna National Golf and Country Club and three JTC Corporation plots will also take place as part of the Changi Southern Corridor construction.",
        {
            "entities": [
                [
                    147,
                    153,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "During the construction of the extension to Clementi station, Commonwealth Avenue West was realigned to accommodate the viaduct.",
        {
            "entities": [
                [
                    44,
                    52,
                    "LOC"
                ],
                [
                    62,
                    86,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Green spaces would be expanded from 2000 to 4500 ha, with the opening of areas such as Pulau Ubin and the Central Catchment Reserve, which will be  accessible by Park Connectors.",
        {
            "entities": [
                [
                    87,
                    97,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "At Outram Park station, to minimise any movement to the East West line (EWL) tunnels, an arch roof of steel pipes filled with cement were laid underneath the EWL tunnels.",
        {
            "entities": [
                [
                    3,
                    14,
                    "LOC"
                ],
                [
                    56,
                    65,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "In addition, a future \"Downtown South\" resort, similar to the current NTUC Downtown East in Pasir Ris, will be located on Pulau Brani once the port moves out in 2027.",
        {
            "entities": [
                [
                    23,
                    31,
                    "LOC"
                ],
                [
                    75,
                    88,
                    "LOC"
                ],
                [
                    92,
                    101,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Built on the former Kallang baseball/softball field, the Kallang Football Hub will house the national training centre and ActiveSG Football Academy.",
        {
            "entities": [
                [
                    20,
                    27,
                    "LOC"
                ],
                [
                    57,
                    64,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Yeo's successor, Mah Bow Tan, had explained that, given the low population of the northeast area, it would not be financially viable to build the NEL in lieu of the Woodlands extension.",
        {
            "entities": [
                [
                    165,
                    174,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Tuas West extension stations have had half-height platform screen doors, manufactured by Fangda, since their opening.",
        {
            "entities": [
                [
                    0,
                    4,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The line was planned to have 18 stations, with a possible extension to Tanjong Pagar station.",
        {
            "entities": [
                [
                    71,
                    84,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Kim Chuan Depot, together with the adjacent Tai Seng Facility Building, operated in a minor capacity until Stage 3 opened.",
        {
            "entities": [
                [
                    0,
                    15,
                    "LOC"
                ],
                [
                    44,
                    52,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Opening of reserved stationsOn 17 June 2003, operator SBS Transit announced that two stations  – Woodleigh and Buangkok  – would not open along with the other NEL stations.",
        {
            "entities": [
                [
                    97,
                    106,
                    "LOC"
                ],
                [
                    111,
                    119,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Coloured red on the rail map, the line is 45 kilometres (28 mi) long and serves 27 stations, 11 of which, between the Bishan and Marina South Pier stations, are underground.",
        {
            "entities": [
                [
                    118,
                    124,
                    "LOC"
                ],
                [
                    129,
                    146,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Expansion of Woodlands CheckpointFirst announced on 30 March 2017 by the Immigration and Checkpoints Authority (ICA), the current Woodlands Checkpoint will be expanded with the addition of a new wing to be built at the site of the Old Woodlands Town Centre, adjacent to the checkpoint.",
        {
            "entities": [
                [
                    13,
                    22,
                    "LOC"
                ],
                [
                    130,
                    150,
                    "LOC"
                ],
                [
                    227,
                    234,
                    "LOC"
                ],
                [
                    235,
                    244,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "After Sembawang station, the line follows the route of Canberra Link and Yishun Avenue 2, curving southwards.",
        {
            "entities": [
                [
                    6,
                    15,
                    "LOC"
                ],
                [
                    55,
                    68,
                    "LOC"
                ],
                [
                    73,
                    88,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "It commenced operation starting with Stage 1 from Woodlands North to Woodlands South on 31 January 2020.",
        {
            "entities": [
                [
                    50,
                    65,
                    "LOC"
                ],
                [
                    69,
                    84,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "An extension from Expo is planned to begin operations in 2024, adding an additional 2.2 kilometres and 2 stations to the line, terminating at Sungei Bedok and interchanging with the Thomson-East Coast line.",
        {
            "entities": [
                [
                    18,
                    22,
                    "LOC"
                ],
                [
                    149,
                    154,
                    "LOC"
                ],
                [
                    190,
                    200,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "From 2026, upon the completion of Stage 6, the Circle line will continue eastwards from Harbourfront, paralleling Keppel Road and Ayer Rajah Expressway, and joins the Circle line extension at Marina Bay station.",
        {
            "entities": [
                [
                    88,
                    100,
                    "LOC"
                ],
                [
                    114,
                    125,
                    "LOC"
                ],
                [
                    192,
                    202,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "At present, all lines run with fixed-length trains between three and six cars, with the Thomson–East Coast Line using four cars.",
        {
            "entities": [
                [
                    96,
                    106,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "SBS Transit will operate the line under a 15-year license that is set to expire on 31 March 2033.RouteAs the name implies, the fully-underground 20-kilometre (12 mi) North East line runs from Singapore's city centre to the northeastern parts of the island.",
        {
            "entities": [
                [
                    166,
                    176,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The current MRT network consists of six main lines: the North South Line, East West Line, Circle Line and partially-opened Thomson–East Coast Line operated by SMRT Trains (SMRT Corporation) and the North East Line and Downtown Line operated by SBS Transit.",
        {
            "entities": [
                [
                    52,
                    72,
                    "LOC"
                ],
                [
                    74,
                    88,
                    "LOC"
                ],
                [
                    131,
                    141,
                    "LOC"
                ],
                [
                    194,
                    213,
                    "LOC"
                ],
                [
                    218,
                    226,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "In addition, new attractions like the redevelopment of Pasir Panjang power plants, a proposed \"Downtown South\" resort by NTUC on Pulau Brani to thank workers, revitalisation of Sentosa's beaches, nature and heritage areas on the island too.",
        {
            "entities": [
                [
                    55,
                    68,
                    "LOC"
                ],
                [
                    95,
                    103,
                    "LOC"
                ],
                [
                    177,
                    184,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Facilities and servicesExcept for the partly at-grade Bishan MRT station (North South Line), the entirety of the MRT is either elevated or underground.",
        {
            "entities": [
                [
                    54,
                    60,
                    "LOC"
                ],
                [
                    74,
                    90,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Subsequently, a section of Upper Cross Street between Yue Hwa Building and Block 34 was realigned from 18 January 2010 until the station's completion in 2013.",
        {
            "entities": [
                [
                    27,
                    45,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The existing Punggol Road will also be transformed into a 1.3 km heritage trail, running through the campus and to the waterfront.",
        {
            "entities": [
                [
                    13,
                    25,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "While plans for these lines as well as those currently under construction were formulated long before, the Land Transport Authority's publication of a White Paper titled \"A World Class Land Transport System\" in 1996 galvanised the government's intentions to greatly expand the system.",
        {
            "entities": [
                [
                    107,
                    131,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The line curves from the Yew Tee to Kranji stations and continues eastwards, paralleling Woodlands Avenue 3 (which the line briefly cuts underneath between Kranji and Marsiling stations) and Avenue 7 main roads.",
        {
            "entities": [
                [
                    25,
                    32,
                    "LOC"
                ],
                [
                    36,
                    42,
                    "LOC"
                ],
                [
                    89,
                    107,
                    "LOC"
                ],
                [
                    156,
                    162,
                    "LOC"
                ],
                [
                    167,
                    176,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Jet grout arches were also used to support the North South line (NSL) tunnels when explosives were used to remove the hard rock while tunnelling from Clarke Quay to Dhoby Ghaut.",
        {
            "entities": [
                [
                    47,
                    58,
                    "LOC"
                ],
                [
                    150,
                    161,
                    "LOC"
                ],
                [
                    165,
                    176,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "SlingshotLocated next to the GX-5 Extreme Swing in Clarke Quay and said to be Asia's tallest, Slingshot is an upcoming thrill ride which will catapult riders close to 70 metres into the air, reaching speeds of 160km per hour.",
        {
            "entities": [
                [
                    51,
                    62,
                    "LOC"
                ],
                [
                    78,
                    82,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Since the system's conception in 1987, all train lines have been powered by the 750 volt DC third rail, with the exception of the North East Line which is powered by 1500 volt DC overhead lines.",
        {
            "entities": [
                [
                    126,
                    145,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Service resumed at all stations along the North-South and East-West Lines at 10:35 pm.",
        {
            "entities": [
                [
                    42,
                    53,
                    "LOC"
                ],
                [
                    58,
                    73,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "the official opening of the Dover station on 23 October 2001, then-Minister for Communications and Information Technology Yeo Cheow Tong announced three MRT lines, two of which―the Bukit Timah Line and the northern part of the Eastern Region Line―will be part of today's DTL.",
        {
            "entities": [
                [
                    28,
                    33,
                    "LOC"
                ],
                [
                    181,
                    192,
                    "LOC"
                ],
                [
                    223,
                    241,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "During the construction of the Circle Line on 20 April 2004, a tunnel being constructed under Nicoll Highway collapsed and led to the deaths of four people.",
        {
            "entities": [
                [
                    94,
                    108,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Since 2019, the North South line is fully equipped with Thales SelTrac Communications-based train control moving block signalling system with automatic train control under automatic train operation (ATO)",
        {
            "entities": [
                [
                    16,
                    27,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Subsequently, all stations on the North East, Circle and Downtown lines have taken part in this programme during their construction, with additional artworks installed at stations on other MRT lines.",
        {
            "entities": [
                [
                    30,
                    44,
                    "LOC"
                ],
                [
                    57,
                    65,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Sungei Kadut will be built later if the town's population justifies the necessity for the station.",
        {
            "entities": [
                [
                    0,
                    12,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Historic areas in the city were also strategically conserved to be developed into a 'Civic District' in order to attract tourists and maintain Asian roots in the city.",
        {
            "entities": [
                [
                    85,
                    99,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The tower will be completed by 2022.Central Boulevard TowersScheduled to be completed by 2023, the 99-year leasehold white site at the junction of Central Boulevard and Raffles Quay named Central Boulevard Towers offers premium Grade A office space.",
        {
            "entities": [
                [
                    44,
                    53,
                    "LOC"
                ],
                [
                    147,
                    164,
                    "LOC"
                ],
                [
                    169,
                    181,
                    "LOC"
                ],
                [
                    188,
                    212,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Changi Airport station, the easternmost station on the MRT network, has the widest platform in any underground MRT station in Singapore.",
        {
            "entities": [
                [
                    0,
                    14,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "It runs from Jurong East station, located in Western Singapore, to Marina South Pier station in the Central Area, via Woodlands station in northern Singapore.",
        {
            "entities": [
                [
                    13,
                    24,
                    "LOC"
                ],
                [
                    67,
                    84,
                    "LOC"
                ],
                [
                    96,
                    112,
                    "LOC"
                ],
                [
                    118,
                    127,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The next stage to Dhoby Ghaut station was completed on 17 April 2010 and the next stage to Harbourfront opened on 8 October 2011.",
        {
            "entities": [
                [
                    18,
                    29,
                    "LOC"
                ],
                [
                    91,
                    103,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "One Holland VillagePart of the Urban Redevelopment Authority (URA) plans to revitalise Holland Village, mixed-use development One Holland Village by Far East Organisation is set to be the main focal point in the rejuvenation.",
        {
            "entities": [
                [
                    31,
                    60,
                    "LOC"
                ],
                [
                    87,
                    102,
                    "LOC"
                ],
                [
                    130,
                    145,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "On 10 February 1996, a S$1.2 billion expansion of the North South Line into Woodlands was completed, merging the Branch Line into the North South Line and joining Yishun and Choa Chu Kang stations.",
        {
            "entities": [
                [
                    50,
                    70,
                    "LOC"
                ],
                [
                    76,
                    85,
                    "LOC"
                ],
                [
                    130,
                    150,
                    "LOC"
                ],
                [
                    163,
                    169,
                    "LOC"
                ],
                [
                    174,
                    187,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The final block, named Leven, is a three-storey building with architecture inspired by walk-up apartments found in nearby Tiong Bahru and Chip Bee Gardens.",
        {
            "entities": [
                [
                    122,
                    133,
                    "LOC"
                ],
                [
                    138,
                    154,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Since 28 May 2017, the new signalling system has been operating full-day on the North South line.",
        {
            "entities": [
                [
                    80,
                    91,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "\n\nThe locations of both Hougang BTO projects are also key draws, said Ms Christine Sun, senior vice-president of research and analytics at OrangeTee & Tie.",
        {
            "entities": [
                [
                    24,
                    31,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Hotel facilities include a bar, multiple restaurants, a fitness centre, a celebrations room, and two meeting rooms.",
        {
            "entities": [
                [
                    0,
                    5,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Construction from Jalan Anak Bukit to Boon Lay Road was started in 1978.",
        {
            "entities": [
                [
                    18,
                    34,
                    "LOC"
                ],
                [
                    38,
                    46,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "RiviereDeveloped by Frasers Property Singapore, Riviere is a pair of 36-storey luxury residential towers, housing 455 units by the Singapore River.",
        {
            "entities": [
                [
                    131,
                    146,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The first phase of redevelopment is estimated to be completed by 2030.New integrated hospital in Bedok NorthAnnounced on 5 March 2020, there will be a new integrated hospital in the east of Singapore to ease the load on the existing Changi General Hospital (CGH) - currently the only hospital in the east.",
        {
            "entities": [
                [
                    97,
                    102,
                    "LOC"
                ],
                [
                    233,
                    256,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "In addition, building conservation saw the greater involvement of the public and the National Heritage Board, through the establishment of a Heritage Advisory Panel and the Our Heritage SG Plan for the heritage sector, while the Conservation Advisory Panel was replaced by a Heritage and Advisory Partnership in 2018.",
        {
            "entities": [
                [
                    85,
                    108,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Beginning at HarbourFront station, the line runs northeast, paralleling the New Bridge Road and Eu Tong Street in Chinatown between Outram Park and Clarke Quay stations.",
        {
            "entities": [
                [
                    13,
                    25,
                    "LOC"
                ],
                [
                    76,
                    91,
                    "LOC"
                ],
                [
                    114,
                    123,
                    "LOC"
                ],
                [
                    132,
                    143,
                    "LOC"
                ],
                [
                    148,
                    159,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Downtown line station and further plans (2007–2013)During the NEL station's construction, provisions were made for Chinatown station to link with a future MRT line.",
        {
            "entities": [
                [
                    0,
                    8,
                    "LOC"
                ],
                [
                    115,
                    124,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Train services between Joo Koon and Gul Circle were temporarily suspended until its resumption on 28 May 2018; between the suspension a free bridging bus service is available between the two stations.",
        {
            "entities": [
                [
                    23,
                    31,
                    "LOC"
                ],
                [
                    36,
                    46,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "This extension will see the addition of three new stations: Keppel, Cantonment, and Prince Edward Road.",
        {
            "entities": [
                [
                    84,
                    102,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "In addition, a 1.3 km heritage trail, converted from the existing Punggol Road will extend from Punggol Waterway Park to Punggol Point Park.",
        {
            "entities": [
                [
                    66,
                    78,
                    "LOC"
                ],
                [
                    96,
                    103,
                    "LOC"
                ],
                [
                    121,
                    134,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "This will be the first major adjustment to the circuit since 2008.The project is scheduled to begin in 2022 and expected to be completed by end-2025.Singtel Waterfront TheatreFirst announced by the Ministry of Culture, Community and Youth on 10 April 2017with the start of construction on 18 June 2019, the S$30 million Singtel Waterfront Theatre at the Esplanade is scheduled to be completed and opened in the second half of 2021.",
        {
            "entities": [
                [
                    354,
                    363,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Situated above the North East MRT line's depot, the expansion will include a new train stabling area, a maintenance workshop, and three new traction power stations.",
        {
            "entities": [
                [
                    15,
                    33,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "It is scheduled to open in 2022.The new 12.5-hectare Rainforest Wild, which aspires to be an authentic representation of a rainforest, will allow visitors to go on aerial walkways that extend from the forest floor to the treetop canopies, or relax in the cool forest in suspended pods.",
        {
            "entities": [
                [
                    53,
                    68,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Located near Lentor MRT station, the new neighbourhood is planned around the existing hillock.",
        {
            "entities": [
                [
                    13,
                    19,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Singapore: Land Transport Authority.",
        {
            "entities": [
                [
                    11,
                    35,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The other station with similar architecture is Dover.",
        {
            "entities": [
                [
                    47,
                    52,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The stations are Gul Circle, Tuas Crescent, Tuas West Road, and Tuas Link.",
        {
            "entities": [
                [
                    17,
                    27,
                    "LOC"
                ],
                [
                    29,
                    42,
                    "LOC"
                ],
                [
                    44,
                    58,
                    "LOC"
                ],
                [
                    64,
                    73,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The first project to be built will be the S$90 million Sentosa Sensoryscape, a themed two-tiered thoroughfare connecting Resorts World Sentosa and the southern beaches, replacing the current linkway.",
        {
            "entities": [
                [
                    55,
                    62,
                    "LOC"
                ],
                [
                    121,
                    142,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "LTA together with the operator, SBS Transit, conducted the necessary tests to ensure safety standards, functional performance and systems compatibility requirements were met before revenue service began on 22 December 2013.Testing for Stage 2 began on 25 October 2015 and rolling stock that was delivered to Gali Batu Depot commenced service in Stage 1 on 21 October 2015.",
        {
            "entities": [
                [
                    308,
                    323,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "On 14 October 2020, train services from Jurong East to Woodlands stations ceased to operate for more than three and a half hours, owing to a faulty power cable, which affected the East West and Circle lines too.",
        {
            "entities": [
                [
                    40,
                    51,
                    "LOC"
                ],
                [
                    55,
                    64,
                    "LOC"
                ],
                [
                    176,
                    189,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "During initial stages after opening, the westbound trains will alternate their terminus between Joo Koon and Tuas Link, where for every two trains, one train will terminate at the former, while the other train will terminate at the latter.",
        {
            "entities": [
                [
                    96,
                    104,
                    "LOC"
                ],
                [
                    109,
                    118,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The condominium and mall are named Sengkang Grand Residences and Sengkang Grand Mall, respectively.",
        {
            "entities": [
                [
                    35,
                    60,
                    "LOC"
                ],
                [
                    65,
                    84,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The 6-kilometre (3.7 mi) line extension to Pasir Ris station was opened ahead of schedule on 16 December 1989 with a sneak preview beforehand.",
        {
            "entities": [
                [
                    43,
                    52,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Hume is an infill station between Hillview and Beauty World and expected to open by 2025.",
        {
            "entities": [
                [
                    34,
                    42,
                    "LOC"
                ],
                [
                    47,
                    59,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "A trackside fire between Raffles Place and Marina Bay stations further exacerbated the disruption.",
        {
            "entities": [
                [
                    25,
                    38,
                    "LOC"
                ],
                [
                    43,
                    53,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "It will also be connected underground to Woodleigh MRT station and Singapore's second air-conditioned underground bus interchange located at adjacent Woodleigh Village.",
        {
            "entities": [
                [
                    41,
                    50,
                    "LOC"
                ],
                [
                    150,
                    167,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "\n\n\"The officer assessed that his life was in imminent danger from the knife-wielding man and therefore opened fire,\" said Assistant Commissioner of Police Marc E, Clementi Police Division commander.",
        {
            "entities": [
                [
                    163,
                    171,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Similar rolling stock is used on the East West Line, with an electrification of 750 V DC powered by a third rail.",
        {
            "entities": [
                [
                    33,
                    51,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Nine more stations from Novena station to Outram Park station via Raffles Place opened on 12 December that year.",
        {
            "entities": [
                [
                    24,
                    30,
                    "LOC"
                ],
                [
                    42,
                    53,
                    "LOC"
                ],
                [
                    66,
                    79,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "\n\nIn comparison, competition is less stiff in the mature estates of Kallang/Whampoa, Queenstown and Tampines.",
        {
            "entities": [
                [
                    68,
                    75,
                    "LOC"
                ],
                [
                    85,
                    95,
                    "LOC"
                ],
                [
                    100,
                    108,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "A new moving-block signalling system, supplied by Thales, replaced the ageing fixed-block signalling system on the North South line.",
        {
            "entities": [
                [
                    115,
                    126,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "\n\nBuilt on a 2.8ha plot, which is the size of about four football fields, One Punggol follows in the steps of two other integrated community hubs - Our Tampines Hub and Heartbeat @ Bedok - that also house multiple community facilities.",
        {
            "entities": [
                [
                    78,
                    85,
                    "LOC"
                ],
                [
                    148,
                    164,
                    "LOC"
                ],
                [
                    169,
                    186,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The decision not to build and open Sennett station, however, generated political controversy, with claims by residents and opposition MP Chiam See Tong that the station would only open if the ruling People's Action Party (PAP) secured the constituency.",
        {
            "entities": [
                [
                    35,
                    42,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "They are stabled at Kim Chuan Depot, which was the world's largest underground depot when it opened in 2009.",
        {
            "entities": [
                [
                    20,
                    35,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "As such, the aircraft will be moved to the newly expanded Tengah Airbase, which has already begun construction.",
        {
            "entities": [
                [
                    58,
                    64,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "\n\nNational water agency PUB issued warnings of flood and heavy rain on several occasions, one of which was a flash flood warning for Upper Paya Lebar Road at 4.35pm.\n\n\"Due to heavy rain, water levels in drains have reached 90 per cent in these areas ...",
        {
            "entities": [
                [
                    133,
                    154,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Stage 3, the final stage of the Downtown Line, opened on 21 October 2017 with its official opening made on 20 October 2017 by Coordinating Minister for Infrastructure and Minister for Transport Khaw Boon Wan.",
        {
            "entities": [
                [
                    32,
                    40,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "In August 2014, plans for the East Coast Integrated Depot, the world's first four-in-one train and bus depot were announced.",
        {
            "entities": [
                [
                    30,
                    40,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Aside from the new bus interchange, the estate will also be served by the future Tampines North MRT station.",
        {
            "entities": [
                [
                    81,
                    95,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The existing driveway at the Bras Basah entrance will also be converted into a lawn for pedestrians.",
        {
            "entities": [
                [
                    29,
                    39,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The Singapore Civil Defence Force (SCDF) said it was alerted to the fire at 6 Gateway Drive at about 1.55pm.",
        {
            "entities": [
                [
                    76,
                    91,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "On 26 October 2016, the Land Transport Authority awarded the civil contract to Lum Chang Building Contractors Pte. Ltd. to build a new platform at Tanah Merah and viaducts for a contract sum of S$325 million.",
        {
            "entities": [
                [
                    24,
                    48,
                    "LOC"
                ],
                [
                    79,
                    97,
                    "LOC"
                ],
                [
                    147,
                    158,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "It was started in 1909 as a railway link by Johor State Railway to connect Johor Bahru to Singapore, then the administrative headquarters of British interests in Southeast Asia.",
        {
            "entities": [
                [
                    162,
                    176,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "DepotsInfrastructureRolling stockFive batches of rolling stock operate on the East West Line, namely the C151, C651, C751B, C151A and C151B from oldest to newest, which are also operated on the North South Line.",
        {
            "entities": [
                [
                    74,
                    92,
                    "LOC"
                ],
                [
                    190,
                    210,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "This area remains the Central Area of Singapore.",
        {
            "entities": [
                [
                    18,
                    47,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "For example, the conserved Tudor Court is planned to house more arts, cultural, and lifestyle offerings, while the covered canal is proposed to be turned into a courtyard for public art and outdoor dining.",
        {
            "entities": [
                [
                    27,
                    38,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The NEL will continue towards Punggol Coast station in 2024, curving eastward past Punggol.",
        {
            "entities": [
                [
                    30,
                    37,
                    "LOC"
                ],
                [
                    83,
                    90,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The project is scheduled to be carried out in phases and is expected to be completed by 2024.HealthcareSGH Campus Master PlanUnveiled on 5 February 2016, the 43-hectare Singapore General Hospital (SGH) Campus at Outram will be redeveloped and expanded over the next two decades.",
        {
            "entities": [
                [
                    169,
                    195,
                    "LOC"
                ],
                [
                    212,
                    218,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The site is envisioned to be developed into a distinctive waterfront landmark and offer seamless connections between the two attractions of Fort Canning Park and Singapore River.",
        {
            "entities": [
                [
                    140,
                    152,
                    "LOC"
                ],
                [
                    162,
                    177,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "It serves the ethnic enclave of Chinatown.",
        {
            "entities": [
                [
                    32,
                    41,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "A two-station extension to Marina Bay station was opened on 14 January 2012.",
        {
            "entities": [
                [
                    27,
                    37,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "RouteThe Pan Island Expressway measures 42.8 kilometres (26.6 mi) and is the longest expressway in Singapore.",
        {
            "entities": [
                [
                    9,
                    30,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Brickland MRT station, to be located between Choa Chu Kang MRT station and Bukit Gombak MRT station, will serve residents living in the surrounding areas and the upcoming Tengah New Town.",
        {
            "entities": [
                [
                    0,
                    9,
                    "LOC"
                ],
                [
                    45,
                    58,
                    "LOC"
                ],
                [
                    75,
                    87,
                    "LOC"
                ],
                [
                    171,
                    177,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Gali Batu Depot is the first MRT depot in Singapore to achieve the certification of Building and Construction Authority (BCA) Green Mark Gold.",
        {
            "entities": [
                [
                    0,
                    15,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Network and operationsServicesTrain services on the North South MRT line operates from approximately 5:30 am to around midnight daily.",
        {
            "entities": [
                [
                    48,
                    67,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Changi Northern and Southern CorridorA two-part infrastructure project near Changi Airport designed to complement the upcoming Cross Island MRT line and future Changi Airport Terminal 5, the Changi Northern and Southern Corridor includes the widening of existing roads, building of new roads, a new viaduct, and erecting new cycling paths.",
        {
            "entities": [
                [
                    0,
                    6,
                    "LOC"
                ],
                [
                    20,
                    38,
                    "LOC"
                ],
                [
                    76,
                    90,
                    "LOC"
                ],
                [
                    127,
                    139,
                    "LOC"
                ],
                [
                    160,
                    174,
                    "LOC"
                ],
                [
                    191,
                    197,
                    "LOC"
                ],
                [
                    211,
                    228,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The Thomson-East Coast line will also be extended, with an additional MRT station serving the future Changi Airport Terminal 5.",
        {
            "entities": [
                [
                    12,
                    22,
                    "LOC"
                ],
                [
                    101,
                    115,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "On 27 April 2007, then Transport Minister Raymond Lim announced that the Downtown Line would be built in three stages stretching 40 kilometres (25 mi) with 33 stations.",
        {
            "entities": [
                [
                    73,
                    81,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "During the construction of this section of the expressway, rocks had to be excavated near Adam Road.",
        {
            "entities": [
                [
                    90,
                    99,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The planning, construction and maintenance of the road network is overseen by the Land Transport Authority (LTA), and this extends to expressways in Singapore.",
        {
            "entities": [
                [
                    82,
                    106,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The new line provides commuters with another alternative for east–west travel to the current East West line and Downtown line.",
        {
            "entities": [
                [
                    93,
                    102,
                    "LOC"
                ],
                [
                    112,
                    120,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "As the main government agency responsible for the urban planning of Singapore, the Urban Redevelopment Authority seeks to implement efficient land use and minimise pollution while maintaining convenient transport, which are Singapore's largest concerns because of its situation as a city-state.",
        {
            "entities": [
                [
                    83,
                    112,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "After the Madrid train bombings in 2004 and the foiled plot to bomb the Yishun MRT station in 2001, the operators deployed private, unarmed guards to patrol station platforms and conduct checks on the belongings of commuters, especially those carrying bulky items.",
        {
            "entities": [
                [
                    72,
                    78,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The operator said the team had permission to access the tracks, but did not coordinate with a signal unit in the station control to ensure train captains in the area where the team was exercised caution while pulling into Pasir Ris station.",
        {
            "entities": [
                [
                    222,
                    231,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The line, then named the Marina Line, was first announced on 16 October 1997.",
        {
            "entities": [
                [
                    21,
                    36,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The first platform screen doors by ST Electronics were installed at Pasir Ris, Jurong East and Yishun stations in 2009 as trial runs.",
        {
            "entities": [
                [
                    68,
                    77,
                    "LOC"
                ],
                [
                    79,
                    90,
                    "LOC"
                ],
                [
                    95,
                    101,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The redevelopment will allow for greater accessibility from Queensway, and house more spaces for trials on new care models.",
        {
            "entities": [
                [
                    60,
                    69,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "An Integrated Train Testing Centre with several test tracks for different situations and workshops for maintenance and refurbishment is also to be built at Tuas by 2022, with the main function being to test trains and integrated systems robustly before they are deployed on operational lines.",
        {
            "entities": [
                [
                    156,
                    160,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The line was expected to relieve the traffic congestion on the Thomson–Sembawang road corridor.",
        {
            "entities": [
                [
                    71,
                    80,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Since the 2010s, due to the ageing infrastructure of the North South Line (being the oldest and heavily utilised MRT line), significant improvements have been made on this line, such as the replacement of sleepers, third rail replacement and the introduction of new rolling stocks (the C151B and the C151C) to replace the older rolling stocks and increase passenger capacity.",
        {
            "entities": [
                [
                    53,
                    73,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The lowest recorded temperature was 19.0 °C (66.2 °F) in 14 February 1989 at Paya Lebar.",
        {
            "entities": [
                [
                    77,
                    87,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Thomson–East Coast",
        {
            "entities": [
                [
                    8,
                    18,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Tunnelling works for the CCL6 were completed on 12 January 2022, with a final tunnel breakthrough from Prince Edward Road station into Cantonment station.",
        {
            "entities": [
                [
                    103,
                    121,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "\n\nTampines drew comparatively fewer applicants, with more than two first-time applicants vying for each of the 881 five-room flats on offer at Tampines GreenQuartz and Tampines GreenJade.",
        {
            "entities": [
                [
                    2,
                    10,
                    "LOC"
                ],
                [
                    143,
                    151,
                    "LOC"
                ],
                [
                    168,
                    176,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The farthest outlying island is Pedra Branca.",
        {
            "entities": [
                [
                    32,
                    44,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "It will also be integrated with the conserved Beach Road Police Station, to be fitted with shops.",
        {
            "entities": [
                [
                    46,
                    56,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "A two-station extension to Marina Bay opened on 14 January 2012.Circle Line Stage 6On 17 January 2013, then-Minister for Transport Lui Tuck Yew announced 'Circle Line Stage 6' which will 'close the circle', set to be completed by 2025.",
        {
            "entities": [
                [
                    27,
                    37,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Tampines Walking and Cycling TownAfter Ang Mo Kio, Tampines will be the second walking and cycling town in Singapore when works to improve the town's infrastructure are completed.",
        {
            "entities": [
                [
                    0,
                    8,
                    "LOC"
                ],
                [
                    39,
                    49,
                    "LOC"
                ],
                [
                    51,
                    59,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "A reserved station \"NE2\" between the HarbourFront and Outram Park stations, may be built in the future depending on the developments between the two stations.",
        {
            "entities": [
                [
                    37,
                    49,
                    "LOC"
                ],
                [
                    54,
                    65,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The widened portions were progressively opened to traffic from July 2013.List of exitsReferencesExternal links Media related to Pan Island Expressway at Wikimedia CommonsA list of PIE interchangesReview of the play \"Pan Island Expressway\"",
        {
            "entities": [
                [
                    128,
                    149,
                    "LOC"
                ],
                [
                    216,
                    237,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "This line links Siloso Point to Imbiah.",
        {
            "entities": [
                [
                    16,
                    31,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "A knife-wielding man was shot and arrested by police outside Clementi Neighbourhood Police Centre, said the police in the early hours of Friday (Feb 18).",
        {
            "entities": [
                [
                    61,
                    97,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "This land acquisition will result in the combined site area to be 50% more than the existing Guoco Midtown, and is set to become one of the largest developments in the Central Business District (CBD).",
        {
            "entities": [
                [
                    93,
                    106,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Bedok Food City will house the factories that are in the food industry, while Defu Industrial City will house factories in the general industries.",
        {
            "entities": [
                [
                    0,
                    5,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Avenue South ResidenceAvenue South Residence is a 1074-unit condominium currently being built at Silat Avenue, along the historic KTM Rail Corridor.",
        {
            "entities": [
                [
                    97,
                    109,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The Istana Park would also be better integrated with the Istana's entrance and commercial developments in its surrounding with roads that include use by pedestrians.",
        {
            "entities": [
                [
                    4,
                    10,
                    "LOC"
                ],
                [
                    57,
                    63,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Stage 1 of Downtown line opened on 22 December 2013 with its official opening made on 21 December 2013 by Prime Minister Lee Hsien Loong.",
        {
            "entities": [
                [
                    11,
                    19,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The four shops around Sentosa Merlion started closing from the next day onwards.",
        {
            "entities": [
                [
                    22,
                    37,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "With the exception of Bishan, Braddell and Canberra stations, the other stations have island platforms.",
        {
            "entities": [
                [
                    22,
                    28,
                    "LOC"
                ],
                [
                    30,
                    38,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "When the initial line opened, the rolling stock of the North South Line consisted of 66 first-generation C151 trains only.",
        {
            "entities": [
                [
                    51,
                    71,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Singapore: Land Transport Authority.",
        {
            "entities": [
                [
                    11,
                    35,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "PolyclinicAnnounced on 8 December 2019, Serangoon Polyclinic is an upcoming polyclinic located opposite NEX Shopping Mall in Serangoon.",
        {
            "entities": [
                [
                    40,
                    49,
                    "LOC"
                ],
                [
                    125,
                    134,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "With such an extension, there would be a direct connection between Changi Airport and the city.",
        {
            "entities": [
                [
                    67,
                    81,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Stage 2, first conceptualized and announced as the Bukit Timah line on 23 October 2001, is 16.6 kilometres (10.3 mi) long with 12 stations connecting Bukit Panjang and Rochor stations, including four interchange stations.",
        {
            "entities": [
                [
                    51,
                    62,
                    "LOC"
                ],
                [
                    150,
                    163,
                    "LOC"
                ],
                [
                    168,
                    174,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "This revision, undertaken following a fare review by the Public Transport Council, was intended to minimise confusion for commuters.",
        {
            "entities": [
                [
                    57,
                    81,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The PIE was then extended further westward to Tuas between 1991 and 1993.",
        {
            "entities": [
                [
                    46,
                    50,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The centre, located at the former Raffles Country Club in Tuas, will begin operations in phases, with the first phase to be completed by end-2022 to receive new trains and test systems for the Circle line Stage 6.",
        {
            "entities": [
                [
                    58,
                    62,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The proposed Eastern Region Line, slated to be a loop in the eastern regions, aimed to relieve the passenger load on the often-congested East West line and benefiting those living in Tampines, Bedok and Marine Parade.: 16―17 ",
        {
            "entities": [
                [
                    137,
                    146,
                    "LOC"
                ],
                [
                    183,
                    191,
                    "LOC"
                ],
                [
                    193,
                    198,
                    "LOC"
                ],
                [
                    203,
                    216,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Intended to serve as a connection to the Jurong industrial estate and Jurong West, the extension cost $81.3 million and was opened in December 1993.As the amount of traffic using the KJE and PIE to the Jurong industrial estate increased, the Land Transport Authority upgraded the stretch of the PIE between Tengah Flyover and Tuas Road to a four-lane dual carriageway from the previous three lanes.",
        {
            "entities": [
                [
                    70,
                    81,
                    "LOC"
                ],
                [
                    242,
                    266,
                    "LOC"
                ],
                [
                    307,
                    313,
                    "LOC"
                ],
                [
                    326,
                    335,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "As the station spans over Punggol Central at 320 metres (350 yards) to accommodate the bus stops, taxi stands and passenger drop-off points along that road, Punggol station is the longest station on the NEL.Public",
        {
            "entities": [
                [
                    26,
                    41,
                    "LOC"
                ],
                [
                    157,
                    164,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The Downtown line depot will be located underground, followed by the Thomson-East Coast line depot on ground level and the East West line depot on the level above it.",
        {
            "entities": [
                [
                    4,
                    12,
                    "LOC"
                ],
                [
                    77,
                    87,
                    "LOC"
                ],
                [
                    123,
                    132,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Other areas outside of the city core like Tampines New Town were transformed from rural wastelands to modern residential living areas, whereas Jurong Industrial Estate was developed into a thriving industrial and residential area.",
        {
            "entities": [
                [
                    42,
                    50,
                    "LOC"
                ],
                [
                    143,
                    167,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The third and final stage, from Fort Canning to Expo station, opened in October 2017.",
        {
            "entities": [
                [
                    32,
                    44,
                    "LOC"
                ],
                [
                    48,
                    52,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Kallang Riverside Park will also be redeveloped into a waterfront park as part of the plan.",
        {
            "entities": [
                [
                    0,
                    17,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The new third rail replaced its 30-year-old predecessor and is expected to increase reliability of the East West line's electrical system.",
        {
            "entities": [
                [
                    103,
                    112,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The DTE, initially planned to be a branch of the CCL, was revised to be the first stage of the Downtown line (DTL) in 2007.In preparation for the DTL construction, the utilities underneath Cross Street and Upper Cross Street were diverted into a 500-metre (1,600 ft) long Common Utility Trench (CUT).",
        {
            "entities": [
                [
                    95,
                    103,
                    "LOC"
                ],
                [
                    189,
                    201,
                    "LOC"
                ],
                [
                    206,
                    224,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "This will result in the terminus to be shifted from the current Bukit Panjang MRT station to Sungei Kadut MRT station.",
        {
            "entities": [
                [
                    64,
                    77,
                    "LOC"
                ],
                [
                    93,
                    105,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Investigations are still ongoing against the two men, Teo Wee Kiat (SMRT's director of control operations) and Lim Say Heng, both charged for the incident.15 November 2017 train collision and delaysA second train collision occurred on 15 November 2017 at approximately 8.18am, where two C151A trains collided at Joo Koon MRT station.",
        {
            "entities": [
                [
                    312,
                    320,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The cycling path around the development will also be integrated with the larger cycling network of Punggol.",
        {
            "entities": [
                [
                    99,
                    106,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "An extension to connect with the North South line at Sungei Kadut station is also being planned and set to open in the 2030s.",
        {
            "entities": [
                [
                    33,
                    44,
                    "LOC"
                ],
                [
                    53,
                    65,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The line begins at Dhoby Ghaut station, which has an interchange with the North South and North East lines, going eastwards and paralleling Bras Basah Road and Raffles Boulevard, before joining the Circle line extension at Promenade station, which also interchanges with the Downtown line.",
        {
            "entities": [
                [
                    19,
                    30,
                    "LOC"
                ],
                [
                    70,
                    85,
                    "LOC"
                ],
                [
                    90,
                    100,
                    "LOC"
                ],
                [
                    140,
                    155,
                    "LOC"
                ],
                [
                    160,
                    177,
                    "LOC"
                ],
                [
                    223,
                    232,
                    "LOC"
                ],
                [
                    275,
                    283,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "\n\nSenior Minister of State for Health, and Communications and Information, Dr Janil Puthucheary, who is an MP for Pasir Ris-Punggol GRC, said at the topping-up ceremony yesterday that while construction was delayed because of the pandemic, it is on track to open progressively.",
        {
            "entities": [
                [
                    114,
                    123,
                    "LOC"
                ],
                [
                    124,
                    131,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "This incident occurred near the proposed site of the Nicoll Highway station, not far from the Merdeka Bridge.",
        {
            "entities": [
                [
                    53,
                    67,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Dakota and Mountbatten stations were the last two to resume operations.",
        {
            "entities": [
                [
                    0,
                    6,
                    "LOC"
                ],
                [
                    11,
                    22,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The Woodlands line extension, costing S$1.35 billion (US$0.7 billion), took precedence over the S$4.3 billion (US$2.4 billion) NEL.",
        {
            "entities": [
                [
                    4,
                    13,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Since 2016, the Land Transport Authority regulates the public bus service standards and owns relevant assets whereas bus operators bid for operating bus services via competitive tendering, under its Bus Contracting Model.",
        {
            "entities": [
                [
                    16,
                    40,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The line terminates at Marina South Pier.",
        {
            "entities": [
                [
                    23,
                    40,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "\n\nAccording to the police, the attacker had allegedly assaulted a 41-year-old man with a knife along Block 420A Clementi Avenue 1 at about 8.40pm on Thursday.",
        {
            "entities": [
                [
                    107,
                    129,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The total length of cycling paths in Tampines will be three times more than the current length.",
        {
            "entities": [
                [
                    37,
                    45,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Following engagements with the local community, the Land Transport Authority (LTA) implemented measures such as shifting worksite hoarding aside to maximise walking space, working with artists to paint the worksite panels, minimising the worksite space at Pagoda Street and renovating the Garden Bridge to allow its integration with the station.",
        {
            "entities": [
                [
                    52,
                    76,
                    "LOC"
                ],
                [
                    256,
                    269,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Campus Boulevard will be an 800-metre street for pedestrians lined with retail shops and F&B outlets.",
        {
            "entities": [
                [
                    7,
                    16,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The cost exceeded those of the Circle Line (at $6.7 billion) and the North East Line (at $4.6 billion).",
        {
            "entities": [
                [
                    65,
                    84,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The newer Tuas Depot, opened in 2017, provides the East West Line with its own maintenance facility, while Mandai Depot services trains for the Thomson–East Coast line.",
        {
            "entities": [
                [
                    10,
                    14,
                    "LOC"
                ],
                [
                    47,
                    65,
                    "LOC"
                ],
                [
                    107,
                    113,
                    "LOC"
                ],
                [
                    152,
                    162,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "First announced as People's Park MRT station in March 1996, the NEL station was one of the most challenging projects undertaken during that line's construction.",
        {
            "entities": [
                [
                    19,
                    32,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "It will be the second such 'vertical' kampung, after Kampung Admiralty opened in 2018.Harmony Village @ Bukit BatokHarmony Village @ Bukit Batok is the maiden launch of the new Community Care Apartments which is a new type of public housing, with senior-friendly design features and subscription to care services, designed to support seniors aged 65 years and above to age independently within the community.",
        {
            "entities": [
                [
                    53,
                    70,
                    "LOC"
                ],
                [
                    133,
                    144,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "On the other hand, a further extension towards Upper Paya Lebar was announced on 28 April 2001.The Marina Line was eventually merged with a planned LRT line that goes from Paya Lebar to Buona Vista via Serangoon and Bishan to form Circle Line Stage 3 on 20 January 2003, and subsequently Circle Line Stage 4 and 5 on 12 December 2003 when Stage 4 was extended from Buona Vista to World Trade Centre to close up the link and to provide connectivity from the west to Sentosa, becoming the Circle Line.",
        {
            "entities": [
                [
                    47,
                    63,
                    "LOC"
                ],
                [
                    172,
                    182,
                    "LOC"
                ],
                [
                    186,
                    197,
                    "LOC"
                ],
                [
                    202,
                    211,
                    "LOC"
                ],
                [
                    216,
                    222,
                    "LOC"
                ],
                [
                    365,
                    376,
                    "LOC"
                ],
                [
                    465,
                    472,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The Downtown line will be extended to the future Sungei Kadut MRT station.",
        {
            "entities": [
                [
                    4,
                    12,
                    "LOC"
                ],
                [
                    49,
                    61,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Home-grown hospitality group, Banyan Tree, has been appointed to develop and operate the eco-resort, which will be built on a 4.6-hectare site currently housing the Singapore Zoo's back-of-house facilities.",
        {
            "entities": [
                [
                    165,
                    178,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The future Changi East Urban District, situated between the upcoming Changi Airport Terminal 5 and the existing Tanah Merah Ferry Terminal, will house offices, smart work centres, conference rooms and halls, hotels, and serviced apartments in landscaped public spaces.",
        {
            "entities": [
                [
                    11,
                    17,
                    "LOC"
                ],
                [
                    69,
                    83,
                    "LOC"
                ],
                [
                    112,
                    138,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Train services between Marina South Pier and Newton resumed at about 9:20 pm on the same day, followed by Newton and Ang Mo Kio at around 2 pm the following day.",
        {
            "entities": [
                [
                    23,
                    40,
                    "LOC"
                ],
                [
                    45,
                    51,
                    "LOC"
                ],
                [
                    106,
                    112,
                    "LOC"
                ],
                [
                    117,
                    127,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Expected to be completed in 2024, Stage 3e will connect the current East West line at Expo station and the future TEL at Sungei Bedok station.",
        {
            "entities": [
                [
                    68,
                    77,
                    "LOC"
                ],
                [
                    86,
                    90,
                    "LOC"
                ],
                [
                    128,
                    133,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Scheduled to be operational by 2030, the integrated hospital will be located next to Bedok North MRT station.",
        {
            "entities": [
                [
                    85,
                    96,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The section of the expressway between Upper Bukit Timah and Corporation Road was opened soon after on 31 January 1981 by Lee Yiok Seng, the Parliamentary Secretary of National Development at the time.",
        {
            "entities": [
                [
                    44,
                    55,
                    "LOC"
                ],
                [
                    60,
                    76,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "SMRT Corporation received a S$50,000 fine by the Land Transport Authority for the first security breach.",
        {
            "entities": [
                [
                    49,
                    73,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "DepotsSMRT Corporation has six train depots: Bishan Depot is the central maintenance depot for the North South Line with train overhaul facilities, while Changi Depot and Ulu Pandan Depot inspect and house trains overnight.",
        {
            "entities": [
                [
                    45,
                    57,
                    "LOC"
                ],
                [
                    95,
                    115,
                    "LOC"
                ],
                [
                    154,
                    166,
                    "LOC"
                ],
                [
                    171,
                    181,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "A one-station extension to Punggol Coast station is under construction and expected to be completed in 2024.Being driverless, the line adopts the moving-block Alstom Urbalis 300 CBTC signalling system.",
        {
            "entities": [
                [
                    27,
                    34,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "On 14 June 2005, the Land Transport Authority (LTA) announced the Downtown Extension (renamed to \"Downtown Line Stage 1\"), which would serve the New Downtown at Marina Bay area, where an integrated resort (Marina Bay Sands) and Singapore's second botanical garden (Gardens by the Bay) were to be located.",
        {
            "entities": [
                [
                    21,
                    45,
                    "LOC"
                ],
                [
                    66,
                    74,
                    "LOC"
                ],
                [
                    98,
                    106,
                    "LOC"
                ],
                [
                    149,
                    157,
                    "LOC"
                ],
                [
                    161,
                    171,
                    "LOC"
                ],
                [
                    206,
                    222,
                    "LOC"
                ],
                [
                    276,
                    284,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The CR151 trains will be the first rolling stock on the North South Line to be manufactured by Bombardier, which has also supplied trains for the Downtown Line.",
        {
            "entities": [
                [
                    52,
                    72,
                    "LOC"
                ],
                [
                    146,
                    154,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Different from most museums in the country, the revamped Singapore Philatelic Museum will encourage visitors to explore and learn through artefacts, hands-on and immersive displays, personal stories, and role-playing.",
        {
            "entities": [
                [
                    57,
                    84,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Surrounding landmarks include the religious sites of Buddha Tooth Relic Temple, Masjid Jamae (Chulia), Fairfield Methodist Church, the Sri Mariamman Temple and the Sri Layan Sithi Vinayagar Temple.",
        {
            "entities": [
                [
                    80,
                    101,
                    "LOC"
                ],
                [
                    103,
                    129,
                    "LOC"
                ],
                [
                    135,
                    155,
                    "LOC"
                ],
                [
                    164,
                    196,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "\n\nThe hub, which is around 80 per cent completed, brings together multiple agencies - including the People's Association, Housing Board and the Ministry of Health - to provide facilities and services under one roof.",
        {
            "entities": [
                [
                    100,
                    120,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Under this plan, several districts in the city centre were identified for conservation, open spaces and parks were clearly marked out, and other districts, such as the Golden Shoe and Orchard Road districts, were designated as areas for high-density development.",
        {
            "entities": [
                [
                    184,
                    196,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Resorts World Sentosa (RWS)The RWS will have two new attractions, Minion Park and Super Nintendo World, at Universal Studios Singapore.",
        {
            "entities": [
                [
                    0,
                    21,
                    "LOC"
                ],
                [
                    107,
                    134,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The Meteorological Service Singapore (MSS) warned on Twitter of \"thundery showers over many areas\" in the afternoon.",
        {
            "entities": [
                [
                    4,
                    36,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Enhancement of Rifle Range Nature ParkWith restoration works on habitats in the park begun in January 2019, the upcoming enhanced 67-hectare Rifle Range Park will mainly serve as a buffer to reduce edge effects on the adjacent Bukit Timah Nature Reserve.",
        {
            "entities": [
                [
                    227,
                    238,
                    "LOC"
                ],
                [
                    239,
                    253,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Installation of PSDs across both the North South and East West lines (NSEWL) were completed on 14 March 2012, 3 months ahead of schedule.",
        {
            "entities": [
                [
                    33,
                    48,
                    "LOC"
                ],
                [
                    53,
                    62,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "In order to reduce traffic congestion, Electronic road pricing (ERP) has been enacted around entrances into the Central Area.",
        {
            "entities": [
                [
                    108,
                    124,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The DTL station is 450 metres (1,480 ft) long, with plans to connect the station with the adjacent Telok Ayer station via an underground retail link.",
        {
            "entities": [
                [
                    99,
                    109,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "NS SquareFirst announced in 2017 and a reveal of the artist's impressions and further details on 9 August 2020, the NS Square is set to replace the existing Marina Bay floating platform (The Float @ Marina Bay) and is envisioned to be the central focus of the new downtown area.",
        {
            "entities": [
                [
                    157,
                    167,
                    "LOC"
                ],
                [
                    187,
                    209,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Renovations are currently underway with the move expected to be completed by 2021.Transformation of Orchard RoadAnnounced on 30 January 2019, the 2.4 km Orchard Road will be revamped and rejuvenated with unique experiences and offerings across four sub-precincts namely Tanglin, Orchard, Somerset, and Dhoby Ghaut.",
        {
            "entities": [
                [
                    100,
                    107,
                    "LOC"
                ],
                [
                    153,
                    165,
                    "LOC"
                ],
                [
                    270,
                    277,
                    "LOC"
                ],
                [
                    279,
                    286,
                    "LOC"
                ],
                [
                    288,
                    296,
                    "LOC"
                ],
                [
                    302,
                    313,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The new centre, set to be completed by 2025, will be located at a waterfront site next to Chinese Garden MRT station.",
        {
            "entities": [
                [
                    90,
                    104,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Constructed and opened as part of the North South line (NSL) in the early stages of development, the East West line was formed after the opening of the eastern extension to Tanah Merah in 1989.",
        {
            "entities": [
                [
                    38,
                    49,
                    "LOC"
                ],
                [
                    101,
                    110,
                    "LOC"
                ],
                [
                    173,
                    184,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The district will be released for redevelopment through a tender in 2021.Jurong Lake District (JLD)A new draft masterplan for Jurong Lake District was unveiled on 25 August 2017, with new developments in the Lakeside district.",
        {
            "entities": [
                [
                    126,
                    146,
                    "LOC"
                ],
                [
                    208,
                    216,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "One of the boards has been retired and will be donated to the National Heritage Board (NHB) to become part of Singapore's National Collection.",
        {
            "entities": [
                [
                    62,
                    85,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Canberra station opened on 2 November 2019.IncidentsOn 3 March 2003, a 23-year-old man lost control of his vehicle along Lentor Avenue, crashed through the fence, and landed on a stretch of track between Yio Chu Kang and Khatib stations.",
        {
            "entities": [
                [
                    121,
                    134,
                    "LOC"
                ],
                [
                    204,
                    216,
                    "LOC"
                ],
                [
                    221,
                    227,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The zoning of the site has been changed to a business park where the former commercial warehouse space, Big Box, will be redeveloped into Perennial Business City.",
        {
            "entities": [
                [
                    104,
                    111,
                    "LOC"
                ],
                [
                    138,
                    161,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Between the Bencoolen and Jalan Besar stations, the line intersects itself, the first MRT line to do so.",
        {
            "entities": [
                [
                    12,
                    21,
                    "LOC"
                ],
                [
                    26,
                    37,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The northern terminus of Woodlands North is expected to interchange with the Johor Bahru–Singapore Rapid Transit System to provide access to Johor Bahru and the future Iskandar Malaysia Bus Rapid Transit.",
        {
            "entities": [
                [
                    25,
                    40,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "All the trains on the North South Line run with a six-car formation.",
        {
            "entities": [
                [
                    18,
                    38,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "A circular walking and cycling loop named Alive Gateway and Loop will also be built to trace the original Kallang Airport airfield and link to the waterfront.",
        {
            "entities": [
                [
                    106,
                    113,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "It runs in a currently incomplete loop from Dhoby Ghaut station in the city area of Singapore to HarbourFront station in the south via Bishan station in Central Singapore.",
        {
            "entities": [
                [
                    44,
                    55,
                    "LOC"
                ],
                [
                    97,
                    109,
                    "LOC"
                ],
                [
                    135,
                    141,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "However, to reduce strain on the Central Area, several regional centres have been developed, each containing a concentrated commercial district.",
        {
            "entities": [
                [
                    29,
                    45,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Furthermore, the RTS link will be an independent Light Rail Transit (LRT) system rather than using the existing Thomson-East Coast MRT line's system as proposed initially.",
        {
            "entities": [
                [
                    120,
                    130,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Set to be Singapore's first open-air panoramic attraction when completed in 2022, SkyHelix Sentosa will offer visitors a scenic view of Sentosa and the Southern Waterfront.",
        {
            "entities": [
                [
                    91,
                    98,
                    "LOC"
                ],
                [
                    136,
                    143,
                    "LOC"
                ],
                [
                    148,
                    171,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "In February 2021, a woodland reserve the size of 10 football fields just Northwest of Kranji was accidentally cleared for construction purposes, drawing intense criticism from Singapore's conservation groups.",
        {
            "entities": [
                [
                    86,
                    92,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The first phase of the facility is targeted to be completed by 2024.JTC semiconSpaceTo be located in Tampines Wafer Fab Park, the JTC semiconSpace is a new semiconductor facility that will be built in three phases.",
        {
            "entities": [
                [
                    101,
                    124,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "During the initial planning of the line, Sembawang station was only intended as a provisional station, to be built at a later date due to the underdevelopment of Sembawang, and construction began on 19 November 1992.",
        {
            "entities": [
                [
                    41,
                    50,
                    "LOC"
                ],
                [
                    162,
                    171,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "It is forecast to commence operations by 2026.North East Line extensionOriginally scheduled to be completed by 2030, the 1.6-kilometre (0.99 mi) extension is being built from Punggol through Punggol North including the new Punggol Downtown to the new tentatively named Punggol Coast station.",
        {
            "entities": [
                [
                    175,
                    182,
                    "LOC"
                ],
                [
                    191,
                    198,
                    "LOC"
                ],
                [
                    223,
                    230,
                    "LOC"
                ],
                [
                    231,
                    239,
                    "LOC"
                ],
                [
                    269,
                    276,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "\n\nExpected to serve around 200,000 residents, the five-storey building is connected to Punggol MRT station, Punggol Town Square, Waterway Point mall, Punggol Waterway Park and residential blocks by walking paths.",
        {
            "entities": [
                [
                    87,
                    94,
                    "LOC"
                ],
                [
                    108,
                    115,
                    "LOC"
                ],
                [
                    116,
                    127,
                    "LOC"
                ],
                [
                    129,
                    143,
                    "LOC"
                ],
                [
                    150,
                    157,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The line also interchanges with the Downtown line at Botanic Gardens station and the East West line at Buona Vista station.",
        {
            "entities": [
                [
                    36,
                    44,
                    "LOC"
                ],
                [
                    53,
                    68,
                    "LOC"
                ],
                [
                    85,
                    94,
                    "LOC"
                ],
                [
                    103,
                    114,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The very first infill station of the MRT network to be built on an existing line, Dover station opened on 18 October 2001.",
        {
            "entities": [
                [
                    82,
                    87,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Boulevard Park will run through the entire estate, connecting residents from Sun Plaza Park to Sungei Api Api, while Quary Park will feature a sand quarry pond, inspired by the town's history.",
        {
            "entities": [
                [
                    0,
                    9,
                    "LOC"
                ],
                [
                    77,
                    86,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "An update by the Land Transport Authority (LTA) & SMRT on 16 November 2017 stated that LTA and SMRT have decided to isolate for up to one month the operations of the Tuas West extension, which runs on the new signalling system, from the rest of the East West line, which runs on the old signalling system, enabling LTA engineers to carry out further assurance checks together with Thales.",
        {
            "entities": [
                [
                    17,
                    41,
                    "LOC"
                ],
                [
                    166,
                    170,
                    "LOC"
                ],
                [
                    249,
                    258,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Singapore is the first country in Southeast Asia to levy a carbon tax, at $5 per ton, applicable for its largest carbon-emitting corporations that produce more than 25,000 tons of carbon dioxide per year.",
        {
            "entities": [
                [
                    34,
                    48,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "A man-made canal called Punggol Waterway was built, connecting the Serangoon Reservoir and Punggol Reservoir.",
        {
            "entities": [
                [
                    24,
                    31,
                    "LOC"
                ],
                [
                    67,
                    76,
                    "LOC"
                ],
                [
                    91,
                    98,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "To be opened in four stages from 2021, the port will consolidate all existing port operations at Tanjong Pagar, Pasir Panjang, Keppel, and Pulau Brani, and centralise it in the Tuas Terminal from 2027.",
        {
            "entities": [
                [
                    97,
                    110,
                    "LOC"
                ],
                [
                    112,
                    125,
                    "LOC"
                ],
                [
                    177,
                    181,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Two more infill stations (Brickland and Sungei Kadut stations) on the line are being planned and are set to be opened in the 2030s.",
        {
            "entities": [
                [
                    26,
                    35,
                    "LOC"
                ],
                [
                    40,
                    52,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The estate was launched in 2014 with its first Build-to-Order (BTO) housing project named Tampines GreenRidges.",
        {
            "entities": [
                [
                    90,
                    98,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "A train, stalled between Boon Keng and Potong Pasir, had to be manually steered to Farrer Park.",
        {
            "entities": [
                [
                    25,
                    34,
                    "LOC"
                ],
                [
                    39,
                    51,
                    "LOC"
                ],
                [
                    83,
                    94,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Perennial Business City (Former Big Box)Announced on 4 December 2020, the existing Big Box shopping mall situated in Jurong East has been acquired by Perennial Real Estate for redevelopment.",
        {
            "entities": [
                [
                    83,
                    90,
                    "LOC"
                ],
                [
                    117,
                    128,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The station has since started construction on 28 February 2021.Jurong East Integrated Transport HubSet to begin construction in the second quarter of 2021, the upcoming Jurong East Integrated Transport Hub will house community and civic institutions, a 27-storey office tower, and the new Jurong East Bus Interchange.",
        {
            "entities": [
                [
                    169,
                    180,
                    "LOC"
                ],
                [
                    289,
                    300,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The new system became operational between Pioneer and Tuas Link stations on 18 June 2017.",
        {
            "entities": [
                [
                    42,
                    49,
                    "LOC"
                ],
                [
                    54,
                    63,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Community spaces will be split into four main compounds: Village Square, Village Green, Village Central, and the Village Deck.",
        {
            "entities": [
                [
                    73,
                    86,
                    "LOC"
                ],
                [
                    88,
                    103,
                    "LOC"
                ],
                [
                    109,
                    125,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Boon Lay station opened on 6 July 1990, marking the completion of the initial MRT system.",
        {
            "entities": [
                [
                    0,
                    8,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Most of the reclamation will be done at Tekong and Tuas islands, with additional reclamation points beyond 2030 including Marina East, Changi East, and Pasir Ris.",
        {
            "entities": [
                [
                    51,
                    55,
                    "LOC"
                ],
                [
                    122,
                    133,
                    "LOC"
                ],
                [
                    135,
                    141,
                    "LOC"
                ],
                [
                    152,
                    161,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The site will then be redeveloped into a community plaza by 2028.Construction for Chill @ Chong Pang is expected to begin in 2022 and completed in 2027.CanningHill Piers and CanningHill Square (Redevelopment of Liang Court)A new mixed-use, integrated development named CanningHill Piers will be built on the current Liang Court complex with a 696-unit condominium spread across two residential towers, a 2-storey retail mall named CanningHill Square, a 460- to 475-room Moxy hotel by Marriott replacing Novotel, and a 192-unit Somerset serviced residence.",
        {
            "entities": [
                [
                    316,
                    327,
                    "LOC"
                ],
                [
                    527,
                    535,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The line then enters the central area, passing through Little India station before reaching the Central Business District via Bugis station.",
        {
            "entities": [
                [
                    55,
                    67,
                    "LOC"
                ],
                [
                    92,
                    121,
                    "LOC"
                ],
                [
                    126,
                    131,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Downtown LineThe 42-kilometre (26 mi), 34 station fully underground Downtown Line connects the north-west and eastern regions of Singapore with a loop travelling through the city center.",
        {
            "entities": [
                [
                    0,
                    8,
                    "LOC"
                ],
                [
                    68,
                    76,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "A train fault caused the first train heading in the direction of Tuas Link to stall at the station.",
        {
            "entities": [
                [
                    65,
                    74,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Train service on the line resumed on 20 November, with the Tuas West extension between Gul Circle and Tuas Link using the new signalling system and the section between Pasir Ris and Joo Koon, together with the Changi Airport Branch continuing to run on the old signalling system.",
        {
            "entities": [
                [
                    59,
                    63,
                    "LOC"
                ],
                [
                    87,
                    97,
                    "LOC"
                ],
                [
                    102,
                    111,
                    "LOC"
                ],
                [
                    168,
                    177,
                    "LOC"
                ],
                [
                    182,
                    190,
                    "LOC"
                ],
                [
                    210,
                    224,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The new elliptical entrance serving the DTL station reflects the elliptical façade of the nearby Hong Lim Complex.",
        {
            "entities": [
                [
                    97,
                    113,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "A study will also be conducted to determine the stops to be added between the Sungei Kadut and the existing Bukit Panjang stations.",
        {
            "entities": [
                [
                    78,
                    90,
                    "LOC"
                ],
                [
                    108,
                    121,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The trains are fully automatic and controlled by an Operations Control Centre (OCC) at Sengkang Depot.",
        {
            "entities": [
                [
                    87,
                    95,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Kampong BugisAnnounced during the 2017 Budget, Kampong Bugis is a new waterfront development zone in Singapore, which will be given to a master developer, giving flexibility in planning the town layouts as opposed to carving each land plot by itself.",
        {
            "entities": [
                [
                    47,
                    60,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "The 102 five-room flats in Hougang Citrine saw few applicants compared with the four-room units, although only one in more than six will get a unit.",
        {
            "entities": [
                [
                    27,
                    34,
                    "LOC"
                ]
            ]
        }
    ],
    [
        "Unlike the other NEL stations, the entrances of Buangkok station do not employ glass in their design; white Teflon sheets supported by metal frames envelops the entrances.",
        {
            "entities": [
                [
                    48,
                    56,
                    "LOC"
                ]
            ]
        }
    ]
]