{"id": 62, "data": "The Singapore River is a river that runs parallel to Alexandra Road and feeds into the Marina Reservoir in the southern part of Singapore. The immediate upper watershed of the Singapore River is known as the Singapore River Planning Area, although the western part of the watershed is classified under River Valley planning area.", "label": [[4, 19, "LOC"], [53, 67, "LOC"], [87, 103, "LOC"], [128, 137, "LOC"], [176, 191, "LOC"], [208, 224, "LOC"], [302, 314, "LOC"]]}
{"id": 63, "data": "Singapore River planning area sits within the Central Area of the Central Region of Singapore, as defined by the Urban Redevelopment Authority. The planning area shares boundaries with the following - River Valley and Museum to the south, Tanglin and Bukit Merah to the west, Outram to the south and the Downtown Core to the east.", "label": [[0, 15, "LOC"], [45, 58, "LOC"], [84, 93, "LOC"], [113, 142, "LOC"], [201, 213, "LOC"], [218, 224, "LOC"], [239, 246, "LOC"], [251, 262, "LOC"], [276, 282, "LOC"], [304, 317, "LOC"]]}
{"id": 64, "data": "Singapore River at night, as seen from Raffles City", "label": [[0, 15, "LOC"], [39, 51, "LOC"]]}
{"id": 65, "data": "The Singapore River is approximately 3.2 kilometers long from its source at Kim Seng Bridge to where it empties into Marina Bay; the river extends more than two kilometers beyond its original source at Kim Seng Bridge as Alexandra Canal, as far as the junction of Commonwealth Avenue.", "label": [[4, 19, "LOC"], [76, 91, "LOC"], [117, 126, "LOC"], [202, 217, "LOC"], [264, 283, "LOC"], [221, 230, "LOC"], [250, 259, "LOC"]]}
{"id": 66, "data": "As viewed from what is now Marina Bay, Singapore, circa 1900s", "label": [[27, 37, "LOC"], [38, 48, "LOC"]]}
{"id": 67, "data": "The mouth of the Singapore River was the old Port of Singapore, being naturally sheltered by the southern islands. Historically, the city of Singapore initially grew around the port so the river mouth became the centre of trade, commerce and finance.", "label": [[17, 32, "LOC"], [45, 62, "LOC"], [141, 150, "LOC"]]}
{"id": 68, "data": "At one time, Singapore River was the very lifeblood of the colony, the trade artery, the center of commerce activity, the heart of entrepot trade, the marine vessel of importance, the capillaries of life and the place which was frequented by the secret societies, the swaylos (Cantonese for coolies who worked on a boat) and the coolies who worked for the philanthropist Tan Tock Seng at Ellenborough Market and the towkay (Hokkien for business owner) Tan Kim Seng who was busy filling his godown with the riches of the East.", "label": [[13, 28, "LOC"], [388, 407, "LOC"]]}
{"id": 69, "data": "Singapore River is where the colourful and surprising history of the river and the myths and legends can still conjure up memories of the lighters, bumboats, tongkangs with their painted eyes to see the danger ahead and sampans of yesteryear. This is where the Malayan princes once sailed and this is where the bullock carts plodded their way up and down each bank as the river found its way to the former rocky river mouth. This is also where an early civilisation was conquered by the Javanese Majapahit Empire, in the year 1376.", "label": [[0, 15, "LOC"]]}
{"id": 70, "data": "Some of the temples like Yueh Hai Ching Temple and Tan Si Chong Su still stand in the vicinity of the river. Bridges such as Anderson Bridge, Elgin Bridge and Cavenagh Bridge still remain, the Merlion, the shophouses, and the large trees such as Banyan and Madras Thorn. Some parts of this area include quays such as Clarke Quay, Boat Quay and Robertson Quay, which generated trade and extensive demand for services with the boats that landed at the quays. Boat Quay itself was handling three quarters of the shipping service in the 1860s. Shophouses and warehouses flourished around the quays due to their proximity to trade during the colonial era, but presently house various bars, pubs and restaurants, as well as old shops.", "label": [[25, 46, "LOC"], [51, 66, "LOC"], [125, 140, "LOC"], [142, 154, "LOC"], [159, 174, "LOC"], [193, 200, "LOC"], [317, 328, "LOC"], [330, 339, "LOC"], [344, 358, "LOC"], [457, 466, "LOC"]]}
{"id": 72, "data": "Sir Stamford Raffles lost no time after January 1819, when he landed on Singapore River among the orang laut, in bargaining with Temenggong Abdul Rahman, the Temenggong of Johor who then governed the place, having settled in 1811. At the very moment of landing, Raffles must have realised the importance of the river for, in the same year of 1819, the north bank was drained for government buildings, in 1820, the Master Attendant was appointed with an office building to control shipping, and in 1822, the south bank was reclaimed and a retaining wall and steps were built.", "label": [[72, 87, "LOC"], [172, 177, "LOC"]]}
{"id": 74, "data": "Old maps of the river state that it actually originates from Bukit Larangan (currently Fort Canning Hill).", "label": [[87, 104, "LOC"], [61, 75, "LOC"]]}
{"id": 75, "data": "Starting in 1819, there was heavy traffic on the Singapore River due to rapid urbanization and expanding trade. At the same time, it brought in water pollution caused by the disposal of garbage, sewage and other by-products of industries located along the river's banks. The sources of water pollution into the Singapore River and Kallang Basin included waste from pig and duck farms, unsewered premises, street hawkers and vegetable whole sellers. Riverine activities such as transport, boat building and repairs were also found along the Singapore River.", "label": [[49, 64, "LOC"], [311, 326, "LOC"], [331, 344, "LOC"], [540, 555, "LOC"]]}
{"id": 76, "data": "Some 750 lighters plied along the Singapore River and Kallang Basin in 1977. Waste, oil spills and wastewater from these boats and lighters added to the pollution of the rivers. In 1977, Prime Minister Lee Kuan Yew called for a clean up of Singapore's rivers, which included the Singapore River and the Kallang River. The clean up cost the government $300 million and involved a relocation of about 4,000 squatters, along with hawkers and vegetable sellers, whose daily waste flowed into the river. Public housing was found for the squatters, while street hawkers were persuaded to move to hawker centres. The government then dredged foul-smelling mud from the banks and the bottom of the river, clearing the debris and other rubbish.", "label": [[34, 49, "LOC"], [54, 67, "LOC"], [240, 249, "LOC"], [279, 294, "LOC"], [303, 316, "LOC"]]}
{"id": 78, "data": "The river is now part of the Marina Reservoir after damming the Singapore River at its outlet to the sea to create a new reservoir of freshwater. The dam is known as Marina Barrage.", "label": [[29, 45, "LOC"], [64, 79, "LOC"], [166, 180, "LOC"]]}
{"id": 79, "data": "Whereas the original mouth of the Singapore River emptied into Singapore Straits and its southern islands before major land reclamation took place, the Singapore River now empties into Marina Bay - an area of water partially enclosed by the reclamation work. The Port of Singapore is now located to the west of the island, using most of the south-west coast, and passenger ships to Singapore now typically berth at the Singapore Cruise Centre at Harbourfront. Thus the Singapore River's economic role has shifted away from one that of trade, towards more a role accommodated for tourism and aesthetics for the commercial zone which encloses it.", "label": [[34, 49, "LOC"], [63, 80, "LOC"], [152, 167, "LOC"], [185, 195, "LOC"], [263, 280, "LOC"], [382, 391, "LOC"], [419, 442, "LOC"], [446, 458, "LOC"], [469, 484, "LOC"]]}
{"id": 80, "data": "Between 1819, when the first wooden jetty and the first bridge were built over the Singapore River in Singapore, and in 2015, 14 bridges were built across the river (or 17, although Marina Reservoir, where the estuary is now located, is considered a Singapore River). Until 1819, the river could only be crossed by boats and ferries. Some of the bridges were demolished and rebuilt or their purpose was changed (traffic bridge in pedestrian bridge and the like).", "label": [[83, 98, "LOC"], [102, 111, "LOC"], [182, 198, "LOC"], [250, 265, "LOC"]]}
{"id": 81, "data": "Former records from Singapore show a simple wooden bridge over the river from 1819, which had no name, and is considered the first bridge in the city. In 1822, the bridge was replaced by a wooden bridge, the Presentment Bridge, from which later (1862 and 1927) today's Elgin Bridge emerged. In the years that followed, other bridges such as Coleman Bridge (1840), Kim Seng Bridge (1862), Cavenagh Bridge (1869) or Read Bridge (1889) were added. The most recent bridges are the Helix Bridge (2010), Bayfront Bridge (2010) and the Jubilee Bridge (2015).", "label": [[20, 29, "LOC"], [208, 226, "LOC"], [269, 280, "LOC"], [341, 355, "LOC"], [364, 379, "LOC"], [388, 403, "LOC"], [414, 425, "LOC"], [477, 489, "LOC"], [498, 513, "LOC"], [529, 543, "LOC"]]}
